
@inline get𝒙(ap::T,ξ::Node) where T<:AbstractElement{:Quad8} = get𝒙(ap,ξ.ξ,ξ.η)

function get𝒙(ap::T,ξ::Float64,η::Float64) where T<:AbstractElement{:Quad8}
    x₁ = ap.𝓒[1].x
    y₁ = ap.𝓒[1].y
    z₁ = ap.𝓒[1].z
    x₂ = ap.𝓒[2].x
    y₂ = ap.𝓒[2].y
    z₂ = ap.𝓒[2].z
    x₃ = ap.𝓒[3].x
    y₃ = ap.𝓒[3].y
    z₃ = ap.𝓒[3].z
    x₄ = ap.𝓒[4].x
    y₄ = ap.𝓒[4].y
    z₄ = ap.𝓒[4].z
    x₅ = ap.𝓒[5].x
    y₅ = ap.𝓒[5].y
    z₅ = ap.𝓒[5].z
    x₆ = ap.𝓒[6].x
    y₆ = ap.𝓒[6].y
    z₆ = ap.𝓒[6].z
    x₇ = ap.𝓒[7].x
    y₇ = ap.𝓒[7].y
    z₇ = ap.𝓒[7].z
    x₈ = ap.𝓒[8].x
    y₈ = ap.𝓒[8].y
    z₈ = ap.𝓒[8].z
    N₁,N₂,N₃,N₄,N₅,N₆,N₇,N₈ = get𝝭(ap,ξ,η)
    return (x₁*N₁+x₂*N₂+x₃*N₃+x₄*N₄+x₅*N₅+x₆*N₆+x₇*N₇+x₈*N₈,y₁*N₁+y₂*N₂+y₃*N₃+y₄*N₄+y₅*N₅+y₆*N₆+y₇*N₇+y₈*N₈,z₁*N₁+z₂*N₂+z₃*N₃+z₄*N₄+z₅*N₅+z₆*N₆+z₇*N₇+z₈*N₈)
end

function get𝑱(ap::T,ξ::Node) where T<:AbstractElement{:Quad8}
    x₁ = ap.𝓒[1].x
    x₂ = ap.𝓒[2].x
    x₃ = ap.𝓒[3].x
    x₄ = ap.𝓒[4].x    
    x₅ = ap.𝓒[5].x
    x₆ = ap.𝓒[6].x
    x₇ = ap.𝓒[7].x
    x₈ = ap.𝓒[8].x
    y₁ = ap.𝓒[1].y
    y₂ = ap.𝓒[2].y
    y₃ = ap.𝓒[3].y
    y₄ = ap.𝓒[4].y    
    y₅ = ap.𝓒[5].y
    y₆ = ap.𝓒[6].y
    y₇ = ap.𝓒[7].y
    y₈ = ap.𝓒[8].y
    ∂N₁∂ξ,∂N₂∂ξ,∂N₃∂ξ,∂N₄∂ξ,∂N₅∂ξ,∂N₆∂ξ,∂N₇∂ξ,∂N₈∂ξ = get∂𝝭∂ξ(ap,ξ,η)
    ∂N₁∂η,∂N₂∂η,∂N₃∂η,∂N₄∂η,∂N₅∂η,∂N₆∂η,∂N₇∂η,∂N₈∂η = get∂𝝭∂η(ap,ξ,η)
    J₁₁ = ∂N₁∂ξ*x₁ + ∂N₂∂ξ*x₂ + ∂N₃∂ξ*x₃ + ∂N₄∂ξ*x₄ + ∂N₅∂ξ*x₅ + ∂N₆∂ξ*x₆ + ∂N₇∂ξ*x₇ + ∂N₈∂ξ*x₈
    J₁₂ = ∂N₁∂η*x₁ + ∂N₂∂η*x₂ + ∂N₃∂η*x₃ + ∂N₄∂η*x₄ + ∂N₅∂η*x₅ + ∂N₆∂η*x₆ + ∂N₇∂η*x₇ + ∂N₈∂η*x₈
    J₂₁ = ∂N₁∂ξ*y₁ + ∂N₂∂ξ*y₂ + ∂N₃∂ξ*y₃ + ∂N₄∂ξ*y₄ + ∂N₅∂ξ*y₅ + ∂N₆∂ξ*y₆ + ∂N₇∂ξ*y₇ + ∂N₈∂ξ*y₈
    J₂₂ = ∂N₁∂η*y₁ + ∂N₂∂η*y₂ + ∂N₃∂η*y₃ + ∂N₄∂η*y₄ + ∂N₅∂η*y₅ + ∂N₆∂η*y₆ + ∂N₇∂η*y₇ + ∂N₈∂η*y₈
    return J₁₁,J₂₁,J₁₂,J₂₂
end

@inline function get𝐽(ap::T,ξ::Node) where T<:AbstractElement{:Quad8}
    J₁₁,J₂₁,J₁₂,J₂₂ = get𝑱(ap,ξ)
    return J₁₁*J₂₂-J₂₁*J₁₂
end

@inline get𝑤(ap::T,ξ::Node) where T<:AbstractElement{:Quad8} = get𝐽(ap,ξ)*ξ.w

function set𝝭!(ap::Element{:Quad8},x::Node)
    ξ = x.ξ
    η = x.η
    𝝭 = x[:𝝭]
    𝝭[1] = 0.25*(1.0-ξ)*(1.0-η)*(-ξ-η-1)
    𝝭[2] = 0.25*(1.0+ξ)*(1.0-η)*(ξ-η-1)
    𝝭[3] = 0.25*(1.0+ξ)*(1.0+η)*(ξ+η-1)
    𝝭[4] = 0.25*(1.0-ξ)*(1.0+η)*(-ξ+η-1)
    𝝭[5] = 0.5*(1.0-ξ^2)*(1.0-η)
    𝝭[6] = 0.5*(1.0+ξ)*(1.0-η^2)
    𝝭[7] = 0.5*(1.0-ξ^2)*(1.0+η)
    𝝭[8] = 0.5*(1.0-ξ)*(1.0-η^2)
end

function set∇𝝭!(ap::Element{:Quad8},x::Node)
    𝓒 = ap.𝓒
    x₁,x₂,x₃,x₄,x₅,x₆,x₇,x₈ = (xᵢ.x for xᵢ in 𝓒)
    y₁,y₂,y₃,y₄,y₅,y₆,y₇,y₈ = (xᵢ.y for xᵢ in 𝓒)
    ∂N₁∂ξ,∂N₂∂ξ,∂N₃∂ξ,∂N₄∂ξ,∂N₅∂ξ,∂N₆∂ξ,∂N₇∂ξ,∂N₈∂ξ = get∂𝝭∂ξ(ap,x.ξ,x.η)
    ∂N₁∂η,∂N₂∂η,∂N₃∂η,∂N₄∂η,∂N₅∂η,∂N₆∂η,∂N₇∂η,∂N₈∂η = get∂𝝭∂η(ap,x.ξ,x.η)
    ∂x∂ξ = ∂N₁∂ξ*x₁ + ∂N₂∂ξ*x₂ + ∂N₃∂ξ*x₃ + ∂N₄∂ξ*x₄ + ∂N₅∂ξ*x₅ + ∂N₆∂ξ*x₆ + ∂N₇∂ξ*x₇ + ∂N₈∂ξ*x₈
    ∂x∂η = ∂N₁∂η*x₁ + ∂N₂∂η*x₂ + ∂N₃∂η*x₃ + ∂N₄∂η*x₄ + ∂N₅∂η*x₅ + ∂N₆∂η*x₆ + ∂N₇∂η*x₇ + ∂N₈∂η*x₈
    ∂y∂ξ = ∂N₁∂ξ*y₁ + ∂N₂∂ξ*y₂ + ∂N₃∂ξ*y₃ + ∂N₄∂ξ*y₄ + ∂N₅∂ξ*y₅ + ∂N₆∂ξ*y₆ + ∂N₇∂ξ*y₇ + ∂N₈∂ξ*y₈
    ∂y∂η = ∂N₁∂η*y₁ + ∂N₂∂η*y₂ + ∂N₃∂η*y₃ + ∂N₄∂η*y₄ + ∂N₅∂η*y₅ + ∂N₆∂η*y₆ + ∂N₇∂η*y₇ + ∂N₈∂η*y₈
    detJ = ∂x∂ξ*∂y∂η - ∂x∂η*∂y∂ξ
    ∂ξ∂x =   ∂y∂η/detJ
    ∂η∂x = - ∂y∂ξ/detJ
    ∂ξ∂y = - ∂x∂η/detJ
    ∂η∂y =   ∂x∂ξ/detJ
    ∂𝝭∂x = x[:∂𝝭∂x]
    ∂𝝭∂y = x[:∂𝝭∂y]
    ∂𝝭∂x[1] = ∂N₁∂ξ*∂ξ∂x + ∂N₁∂η*∂η∂x
    ∂𝝭∂x[2] = ∂N₂∂ξ*∂ξ∂x + ∂N₂∂η*∂η∂x
    ∂𝝭∂x[3] = ∂N₃∂ξ*∂ξ∂x + ∂N₃∂η*∂η∂x
    ∂𝝭∂x[4] = ∂N₄∂ξ*∂ξ∂x + ∂N₄∂η*∂η∂x
    ∂𝝭∂x[5] = ∂N₅∂ξ*∂ξ∂x + ∂N₅∂η*∂η∂x
    ∂𝝭∂x[6] = ∂N₆∂ξ*∂ξ∂x + ∂N₆∂η*∂η∂x
    ∂𝝭∂x[7] = ∂N₇∂ξ*∂ξ∂x + ∂N₇∂η*∂η∂x
    ∂𝝭∂x[8] = ∂N₈∂ξ*∂ξ∂x + ∂N₈∂η*∂η∂x
    ∂𝝭∂y[1] = ∂N₁∂ξ*∂ξ∂y + ∂N₁∂η*∂η∂y
    ∂𝝭∂y[2] = ∂N₂∂ξ*∂ξ∂y + ∂N₂∂η*∂η∂y
    ∂𝝭∂y[3] = ∂N₃∂ξ*∂ξ∂y + ∂N₃∂η*∂η∂y
    ∂𝝭∂y[4] = ∂N₄∂ξ*∂ξ∂y + ∂N₄∂η*∂η∂y
    ∂𝝭∂y[5] = ∂N₅∂ξ*∂ξ∂y + ∂N₅∂η*∂η∂y
    ∂𝝭∂y[6] = ∂N₆∂ξ*∂ξ∂y + ∂N₆∂η*∂η∂y
    ∂𝝭∂y[7] = ∂N₇∂ξ*∂ξ∂y + ∂N₇∂η*∂η∂y
    ∂𝝭∂y[8] = ∂N₈∂ξ*∂ξ∂y + ∂N₈∂η*∂η∂y
end

function get∂𝝭∂ξ(::Element{:Quad8},ξ::Float64,η::Float64)
    ∂N₁∂ξ =   0.25*(2*ξ+η)*(1-η)
    ∂N₂∂ξ =   0.25*(2*ξ-η)*(1-η)
    ∂N₃∂ξ =   0.25*(2*ξ+η)*(1+η)
    ∂N₄∂ξ =   0.25*(2*ξ-η)*(1+η)
    ∂N₅∂ξ = - ξ*(1-η)
    ∂N₆∂ξ =   0.5*(1-η^2)
    ∂N₇∂ξ = - ξ*(1+η)
    ∂N₈∂ξ = - 0.5*(1-η^2)
    return (∂N₁∂ξ,∂N₂∂ξ,∂N₃∂ξ,∂N₄∂ξ,∂N₅∂ξ,∂N₆∂ξ,∂N₇∂ξ,∂N₈∂ξ)
end

function get∂𝝭∂η(::Element{:Quad8},ξ::Float64,η::Float64)
    ∂N₁∂η =   0.25*(1-ξ)*(2*η+ξ)
    ∂N₂∂η =   0.25*(1+ξ)*(2*η-ξ)
    ∂N₃∂η =   0.25*(1+ξ)*(2*η+ξ)
    ∂N₄∂η =   0.25*(1-ξ)*(2*η-ξ)
    ∂N₅∂η = - 0.5*(1-ξ^2)
    ∂N₆∂η = - η*(1+ξ)
    ∂N₇∂η =   0.5*(1-ξ^2)
    ∂N₈∂η = - η*(1-ξ)
    return (∂N₁∂η,∂N₂∂η,∂N₃∂η,∂N₄∂η,∂N₅∂η,∂N₆∂η,∂N₇∂η,∂N₈∂η)
end