
struct RKGradientSmoothing{𝑝,𝑠,𝜙,T}<:AbstractReproducingKernel{𝑠,𝜙,T}
    𝓒::Tuple{Int,Int,Vector{Node{(:𝐼,),1}}}
    𝓖::Tuple{Int,Int,Vector{Node{(:𝑔,:𝐺,:𝐶,:𝑠),4}}}
    𝓖ˢ::Tuple{Int,Int,Vector{Node{(:𝑔,:𝐺,:𝐶,:𝑠),4}}}
end

function Base.getproperty(a::RKGradientSmoothing,s::Symbol)
    if s∈(:𝓒,:𝓖,:𝓖ˢ)
        𝓐 =  getfield(a,s)
        return (𝓐[3][𝓐[1]+i] for i in 1:𝓐[2])
    else
        𝓖 = getfield(a,:𝓖)
        ξ = 𝓖[3][𝓖[1]+1]
        return getproperty(ξ,s)
    end
end

get𝑛𝒑(    ::RKGradientSmoothing{:Linear1D}) = 1
get𝒑(     ::RKGradientSmoothing{:Linear1D},::Any) = (1.0,)
get∂𝒑∂ξ(  ::RKGradientSmoothing{:Linear1D},::Any) = (0.0,)
get∂²𝒑∂ξ²(::RKGradientSmoothing{:Linear1D},::Any) = (0.0,)

get𝑛𝒑(    ::RKGradientSmoothing{:Quadratic1D}) = 2
get𝒑(     ::RKGradientSmoothing{:Quadratic1D},ξ::Float64) = (1.0,0.5*(1.0-ξ))
get∂𝒑∂ξ(  ::RKGradientSmoothing{:Quadratic1D},::Any) = (0.0,1.0)
get∂²𝒑∂ξ²(::RKGradientSmoothing{:Quadratic1D},::Any) = (0.0,0.0)

get𝑛𝒑(    ::RKGradientSmoothing{:Cubic1D}) = 3
get𝒑(     ::RKGradientSmoothing{:Cubic1D},ξ::Float64) = (1.0,0.5*(1.0-ξ),0.25*(1.0-ξ)^2)
get∂𝒑∂ξ(  ::RKGradientSmoothing{:Cubic1D},ξ::Float64) = (0.,1.0,(1.0-ξ))
get∂²𝒑∂ξ²(::RKGradientSmoothing{:Cubic1D},ξ::Float64) = (0.,0.0,2.0)

get𝑛𝒑(    ::RKGradientSmoothing{:Quartic1D}) = 4
get𝒑(     ::RKGradientSmoothing{:Quartic1D},ξ::Float64) = (1.0,0.5*(1.0-ξ),0.25*(1.0-ξ)^2,0.125*(1.0-ξ)^3)
get∂𝒑∂ξ(  ::RKGradientSmoothing{:Quartic1D},ξ::Float64) = (0.,1.0,(1.0-ξ),0.75*(1.0-ξ)^2)
get∂²𝒑∂ξ²(::RKGradientSmoothing{:Quartic1D},ξ::Float64) = (0.,0.0,2.0,3.0*(1.0-ξ))

get𝑛𝒑(  ::RKGradientSmoothing{:Linear2D}) = 1
get𝒑(   ::RKGradientSmoothing{:Linear2D},::Any,::Any) = (1.,)
get∂𝒑∂ξ(::RKGradientSmoothing{:Linear2D},::Any,::Any) = (0.,)
get∂𝒑∂η(::RKGradientSmoothing{:Linear2D},::Any,::Any) = (0.,)

get𝑛𝒑(     ::RKGradientSmoothing{:Quadratic2D}) = 3
get𝒑(      ::RKGradientSmoothing{:Quadratic2D},ξ::Float64,η::Float64) = (1.,ξ,η)
get∂𝒑∂ξ(   ::RKGradientSmoothing{:Quadratic2D},::Any,::Any) = (0.,1.,0.)
get∂𝒑∂η(   ::RKGradientSmoothing{:Quadratic2D},::Any,::Any) = (0.,0.,1.)
get∂²𝒑∂ξ²( ::RKGradientSmoothing{:Quadratic2D},::Any,::Any) = (0.,0.,0.)
get∂²𝒑∂ξ∂η(::RKGradientSmoothing{:Quadratic2D},::Any,::Any) = (0.,0.,0.)
get∂²𝒑∂η²( ::RKGradientSmoothing{:Quadratic2D},::Any,::Any) = (0.,0.,0.)

get𝑛𝒑(  ::RKGradientSmoothing{:Cubic2D}) = 6
get𝒑(   ::RKGradientSmoothing{:Cubic2D},ξ::Float64,η::Float64) = (1.,ξ,η,ξ^2,ξ*η,η^2)
get∂𝒑∂ξ(::RKGradientSmoothing{:Cubic2D},ξ::Float64,η::Float64) = (0.,1.,0.,2.0*ξ,η,0.)
get∂𝒑∂η(::RKGradientSmoothing{:Cubic2D},ξ::Float64,η::Float64) = (0.,0.,1.,0.,ξ,2.0*η)

get𝑛𝒑(  ::RKGradientSmoothing{:Quartic2D}) = 10
get𝒑(   ::RKGradientSmoothing{:Quartic2D},ξ::Float64,η::Float64) = (1.,ξ,η,ξ^2,ξ*η,η^2,ξ^3,ξ^2*η,ξ*η^2,η^3)
get∂𝒑∂ξ(::RKGradientSmoothing{:Quartic2D},ξ::Float64,η::Float64) = (0.,1.,0.,2.0*ξ,η,0.,3.0*ξ^2,2.0*ξ*η,η^2,0.)
get∂𝒑∂η(::RKGradientSmoothing{:Quartic2D},ξ::Float64,η::Float64) = (0.,0.,1.,0.,ξ,2.0*η,0.,ξ^2,2.0*ξ*η,3.0*η^2)

for 𝒑 in (:(:Linear1D),:(:Quadratic1D),:(:Cubic1D),:(:Quartic1D))
    @eval begin
        get𝒑(  ap::RKGradientSmoothing{$𝒑},x::Node) = get𝒑(ap,x.ξ)
        get∇𝒑( ap::RKGradientSmoothing{$𝒑},x::Node) = get𝒑(ap,x.ξ),get∂𝒑∂ξ(ap,x.ξ)
        get∇²𝒑(ap::RKGradientSmoothing{$𝒑},x::Node) = get𝒑(ap,x.ξ),get∂𝒑∂ξ(ap,x.ξ),get∂²𝒑∂ξ²(ap,x.ξ)
    end
end

for 𝒑 in (:(:Linear2D),:(:Quadratic2D),:(:Cubic2D),:(:Quartic2D))
    @eval begin
        get𝒑(  ap::RKGradientSmoothing{$𝒑},x::Node) = get𝒑(ap,x.ξ,x.η)
        get∇𝒑( ap::RKGradientSmoothing{$𝒑},x::Node) = get𝒑(ap,x.ξ,x.η),get∂𝒑∂ξ(ap,x.ξ,x.η),get∂𝒑∂η(ap,x.ξ,x.η)
        get∇²𝒑(ap::RKGradientSmoothing{$𝒑},x::Node) = get𝒑(ap,x.ξ,x.η),get∂𝒑∂ξ(ap,x.ξ,x.η),get∂𝒑∂η(ap,x.ξ,x.η),get∂²𝒑∂ξ²(ap,x.ξ,x.η),get∂²𝒑∂ξ∂η(ap,x.ξ,x.η),get∂²𝒑∂η²(ap,x.ξ,x.η)
    end
end

function cal𝗠!(ap::RKGradientSmoothing{:Linear1D,𝑠,𝜙,:Seg2}) where {𝑠,𝜙}
    𝗚⁻¹ = get𝗠(ap,:∇̃)
    𝐿 = ap.𝐿
    𝗚⁻¹[1] =  1.0/𝐿
    return 𝗚⁻¹
end

function cal𝗠!(ap::RKGradientSmoothing{:Quadratic1D,𝑠,𝜙,:Seg2}) where {𝑠,𝜙}
    𝗚⁻¹ = get𝗠(ap,:∇̃)
    𝐿 = ap.𝐿
    𝗚⁻¹[1] =  4.0/𝐿
    𝗚⁻¹[2] = -6.0/𝐿
    𝗚⁻¹[3] = 12.0/𝐿
    return 𝗚⁻¹
end

function cal𝗠!(ap::RKGradientSmoothing{:Cubic1D,𝑠,𝜙,:Seg2}) where {𝑠,𝜙}
    𝗚⁻¹ = get𝗠(ap,:∇̃)
    𝐿 = ap.𝐿
    𝗚⁻¹[1] =    9.0/𝐿
    𝗚⁻¹[2] =  -36.0/𝐿
    𝗚⁻¹[3] =  192.0/𝐿
    𝗚⁻¹[4] =   30.0/𝐿
    𝗚⁻¹[5] = -180.0/𝐿
    𝗚⁻¹[6] =  180.0/𝐿
    return 𝗚⁻¹
end

function cal𝗠!(ap::RKGradientSmoothing{:Linear2D,𝑠,𝜙,:Tri3}) where {𝑠,𝜙}
    𝗚⁻¹ = get𝗠(ap,:∇̃)
    𝐴 = ap.𝐴
    𝗚⁻¹[1] = 1.0/𝐴
    return 𝗚⁻¹
end

function cal𝗠!(ap::RKGradientSmoothing{:Quadratic2D,𝑠,𝜙,:Tri3}) where {𝑠,𝜙}
    𝗚⁻¹ = get𝗠(ap,:∇̃)
    𝐴 = ap.𝐴
    𝗚⁻¹[1] =   9.0/𝐴
    𝗚⁻¹[2] = -12.0/𝐴
    𝗚⁻¹[3] =  24.0/𝐴
    𝗚⁻¹[4] = -12.0/𝐴
    𝗚⁻¹[5] =  12.0/𝐴
    𝗚⁻¹[6] =  24.0/𝐴
    return 𝗚⁻¹
end

function cal𝗠!(ap::RKGradientSmoothing{:Cubic2D,𝑠,𝜙,:Tri3}) where {𝑠,𝜙}
    𝗚⁻¹ = get𝗠(ap,:∇̃)
    𝐴 = ap.𝐴
    𝗚⁻¹[1] =   36.0/𝐴
    𝗚⁻¹[2] = -120.0/𝐴
    𝗚⁻¹[3] =  600.0/𝐴
    𝗚⁻¹[4] = -120.0/𝐴
    𝗚⁻¹[5] =  300.0/𝐴
    𝗚⁻¹[6] =  600.0/𝐴
    𝗚⁻¹[7] =   90.0/𝐴
    𝗚⁻¹[8] = -540.0/𝐴
    𝗚⁻¹[9] = -180.0/𝐴
    𝗚⁻¹[10] =  540.0/𝐴
    𝗚⁻¹[11] =  180.0/𝐴
    𝗚⁻¹[12] = -720.0/𝐴
    𝗚⁻¹[13] = -720.0/𝐴
    𝗚⁻¹[14] =  540.0/𝐴
    𝗚⁻¹[15] = 1440.0/𝐴
    𝗚⁻¹[16] =   90.0/𝐴
    𝗚⁻¹[17] = -180.0/𝐴
    𝗚⁻¹[18] = -540.0/𝐴
    𝗚⁻¹[19] =   90.0/𝐴
    𝗚⁻¹[20] =  540.0/𝐴
    𝗚⁻¹[21] =  540.0/𝐴
    return 𝗚⁻¹
end

function set∇𝝭!(ap::RKGradientSmoothing{𝒑,𝑠,𝜙,:Seg2}) where {𝒑,𝑠,𝜙}
    𝓒 = ap.𝓒
    𝓖 = ap.𝓖
    𝓖ˢ = ap.𝓖ˢ
    for ξ̂ in 𝓖
        𝒒̂ = get𝒑(ap,ξ̂)
        𝗚⁻¹ = cal𝗠!(ap)
        𝒒̂ᵀ𝗚⁻¹ = 𝒒̂*𝗚⁻¹
        ∂𝝭∂x = ξ̂[:∂𝝭∂x]
        for i in 1:length(𝓒)
            ∂𝝭∂x[i] = 0.0
        end
        for ξ in 𝓖ˢ
            w = ξ.w/2
            wᵇ = ξ.wᵇ
            D₁ = ξ.D₁
            𝝭 = ξ[:𝝭]
            𝒒, ∂𝒒∂ξ = get∇𝒑(ap,ξ)
            W₁ = 𝒒̂ᵀ𝗚⁻¹*𝒒*D₁*wᵇ + 𝒒̂ᵀ𝗚⁻¹*∂𝒒∂ξ*n₁*w
            for i in 1:length(𝓒)
                ∂𝝭∂x[i] += 𝝭[i]*W₁
            end
        end
    end
end

function set∇𝝭!(ap::RKGradientSmoothing{𝒑,𝑠,𝜙,:Tri3}) where {𝒑,𝑠,𝜙}
    𝓒 = ap.𝓒
    𝓖 = ap.𝓖
    𝓖ˢ = ap.𝓖ˢ
    D₁₁ = ap.D₁₁
    D₂₁ = ap.D₂₁
    D₁₂ = ap.D₁₂
    D₂₂ = ap.D₂₂
    for ξ̂ in 𝓖
        𝒒̂ = get𝒑(ap,ξ̂)
        𝗚⁻¹ = cal𝗠!(ap)
        𝒒̂ᵀ𝗚⁻¹ = 𝒒̂*𝗚⁻¹
        ∂𝝭∂x = ξ̂[:∂𝝭∂x]
        ∂𝝭∂y = ξ̂[:∂𝝭∂y]
        for i in 1:length(𝓒)
            ∂𝝭∂x[i] = 0.0
            ∂𝝭∂y[i] = 0.0
        end
        for ξ in 𝓖ˢ
            w = ξ.w
            wᵇ = ξ.wᵇ
            𝝭 = ξ[:𝝭]
            𝒒, ∂𝒒∂ξ, ∂𝒒∂η = get∇𝒑(ap,ξ)
            𝒒̂ᵀ𝗚⁻¹𝒒 =  𝒒̂ᵀ𝗚⁻¹*𝒒
            𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ = 𝒒̂ᵀ𝗚⁻¹*∂𝒒∂ξ
            𝒒̂ᵀ𝗚⁻¹∂𝒒∂η = 𝒒̂ᵀ𝗚⁻¹*∂𝒒∂η
            D₁ = ξ.D₁
            D₂ = ξ.D₂
            b₁ = 𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ*D₁₁ + 𝒒̂ᵀ𝗚⁻¹∂𝒒∂η*D₂₁
            b₂ = 𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ*D₁₂ + 𝒒̂ᵀ𝗚⁻¹∂𝒒∂η*D₂₂
            W₁ = 𝒒̂ᵀ𝗚⁻¹𝒒*D₁*wᵇ + b₁*w/2
            W₂ = 𝒒̂ᵀ𝗚⁻¹𝒒*D₂*wᵇ + b₂*w/2
            for i in 1:length(𝓒)
                ∂𝝭∂x[i] += 𝝭[i]*W₁
                ∂𝝭∂y[i] += 𝝭[i]*W₂
            end
        end
    end
end

struct RK2ndGradientSmoothing{𝑝,𝑠,𝜙,T}<:AbstractReproducingKernel{𝑠,𝜙,T}
    𝓒::Tuple{Int,Int,Vector{Node{(:𝐼,),1}}}
    𝓖::Tuple{Int,Int,Vector{Node{(:𝑔,:𝐺,:𝐶,:𝑠),4}}}
    𝓖ˢ::Tuple{Int,Int,Vector{Node{(:𝑔,:𝐺,:𝐶,:𝑠),4}}}
    𝓖ʷ::Tuple{Int,Int,Vector{Node{(:𝑔,:𝐺,:𝐶,:𝑠),4}}}
    𝓖ᶿ::Tuple{Int,Int,Vector{Node{(:𝑔,:𝐺,:𝐶,:𝑠),4}}}
    𝓖ᶜ::Tuple{Int,Int,Vector{Node{(:𝑔,:𝐺,:𝐶,:𝑠),4}}}
end

get𝑛𝒑₂(::ReproducingKernel{:Quadratic2D}) = 1
get𝒑₂(::ReproducingKernel{:Quadratic2D},::Any) = (1.,)
get∂𝒑₂∂ξ(::ReproducingKernel{:Quadratic2D},::Any) = (0.,)
get∂𝒑₂∂η(::ReproducingKernel{:Quadratic2D},::Any) = (0.,)
get∂²𝒑₂∂ξ²(::ReproducingKernel{:Quadratic2D},::Any) = (0.,)
get∂²𝒑₂∂ξ∂η(::ReproducingKernel{:Quadratic2D},::Any) = (0.,)

get𝑛𝒑₂(::ReproducingKernel{:Cubic2D}) = 3
get𝒑₂(ap::ReproducingKernel{:Cubic2D},ξ::Node) = get𝒑₂(ap,ξ.ξ,ξ.η)
get𝒑₂(ap::ReproducingKernel{:Cubic2D},ξ::NTuple{3,Float64}) = get𝒑₂(ap,ξ[1],ξ[2])
get𝒑₂(::ReproducingKernel{:Cubic2D},ξ::Float64,η::Float64) = (1.,ξ,η)
get∂𝒑₂∂ξ(ap::ReproducingKernel{:Cubic2D},ξ::Any) = (0.,1.,0.)
get∂𝒑₂∂η(ap::ReproducingKernel{:Cubic2D},ξ::Any) = (0.,0.,1.)
get∂²𝒑₂∂ξ²(ap::ReproducingKernel{:Cubic2D},ξ::Any) = (0.,0.,0.)
get∂²𝒑₂∂ξ∂η(ap::ReproducingKernel{:Cubic2D},ξ::Any) = (0.,0.,0.)
get∂²𝒑₂∂η²(ap::ReproducingKernel{:Cubic2D},ξ::Any) = (0.,0.,0.)

get𝑛𝒑₂(::ReproducingKernel{:Quartic2D}) = 6
get𝒑₂(ap::ReproducingKernel{:Quartic2D},ξ::Node) = get𝒑₂(ap,ξ.ξ,ξ.η)
get𝒑₂(ap::ReproducingKernel{:Quartic2D},ξ::NTuple{3,Float64}) = get𝒑₂(ap,ξ[1],ξ[2])
get𝒑₂(::ReproducingKernel{:Quartic2D},ξ::Float64,η::Float64) = (1.,ξ,η,ξ^2,ξ*η,η^2)
get∂𝒑₂∂ξ(ap::ReproducingKernel{:Quartic2D},ξ::Node) = get∂𝒑₂∂ξ(ap,ξ.ξ,ξ.η)
get∂𝒑₂∂ξ(ap::ReproducingKernel{:Quartic2D},ξ::Float64,η::Float64) = (0.,1.,0.,2.0*ξ,η,0.)
get∂𝒑₂∂η(ap::ReproducingKernel{:Quartic2D},ξ::Node) = get∂𝒑₂∂η(ap,ξ.ξ,ξ.η)
get∂𝒑₂∂η(ap::ReproducingKernel{:Quartic2D},ξ::Float64,η::Float64) = (0.,0.,1.,0.,ξ,2.0*η)
get∂²𝒑₂∂ξ²(ap::ReproducingKernel{:Quartic2D},ξ::Any) = (0.,0.,0.,2.,0.,0.)
get∂²𝒑₂∂ξ∂η(ap::ReproducingKernel{:Quartic2D},ξ::Any) = (0.,0.,0.,0.,1.,0.)
get∂²𝒑₂∂η²(ap::ReproducingKernel{:Quartic2D},ξ::Any) = (0.,0.,0.,0.,0.,2.)
function cal𝗚₂!(ap::ReproducingKernel{:Quadratic2D,𝑠,𝜙,:Tri3}) where {𝑠,𝜙}
    𝗚⁻¹ = get𝗚(ap,:∇̃²)
    𝐴 = ap.𝓖[1].𝐴
    𝗚⁻¹[1] = 1.0/𝐴
    return 𝗚⁻¹
end

function cal𝗚₂!(ap::ReproducingKernel{:Cubic2D,𝑠,𝜙,:Tri3}) where {𝑠,𝜙}
    𝗚⁻¹ = get𝗚(ap,:∇̃²)
    𝐴 = ap.𝓖[1].𝐴
    𝗚⁻¹[1] =   9.0/𝐴
    𝗚⁻¹[2] = -12.0/𝐴
    𝗚⁻¹[3] =  24.0/𝐴
    𝗚⁻¹[4] = -12.0/𝐴
    𝗚⁻¹[5] =  12.0/𝐴
    𝗚⁻¹[6] =  24.0/𝐴
    return 𝗚⁻¹
end

function cal∇𝗚₂!(ap::ReproducingKernel{:Cubic2D,𝑠,𝜙,:Tri3}) where {𝑠,𝜙}
    𝗚⁻¹ = get𝗚(ap,:∇̃²)
    𝗚⁻¹∂ξ = get𝗚(ap,:∂∇̃²∂ξ)
    𝗚⁻¹∂η = get𝗚(ap,:∂∇̃²∂η)
    𝐴 = ap.𝓖[1].𝐴
    𝗚⁻¹[1] =   9.0/𝐴
    𝗚⁻¹[2] = -12.0/𝐴
    𝗚⁻¹[3] =  24.0/𝐴
    𝗚⁻¹[4] = -12.0/𝐴
    𝗚⁻¹[5] =  12.0/𝐴
    𝗚⁻¹[6] =  24.0/𝐴

    𝗚⁻¹∂ξ[1] =   9.0/𝐴
    𝗚⁻¹∂ξ[2] = -12.0/𝐴
    𝗚⁻¹∂ξ[3] =  24.0/𝐴
    𝗚⁻¹∂ξ[4] = -12.0/𝐴
    𝗚⁻¹∂ξ[5] =  12.0/𝐴
    𝗚⁻¹∂ξ[6] =  24.0/𝐴

    𝗚⁻¹∂η[1] =   9.0/𝐴
    𝗚⁻¹∂η[2] = -12.0/𝐴
    𝗚⁻¹∂η[3] =  24.0/𝐴
    𝗚⁻¹∂η[4] = -12.0/𝐴
    𝗚⁻¹∂η[5] =  12.0/𝐴
    𝗚⁻¹∂η[6] =  24.0/𝐴

    return 𝗚⁻¹,𝗚⁻¹∂ξ,𝗚⁻¹∂η
end

function cal𝗚₂!(ap::ReproducingKernel{:Quartic2D,𝑠,𝜙,:Tri3}) where {𝑠,𝜙}
    𝗚⁻¹ = get𝗚(ap,:∇̃²)
    𝐴 = ap.𝓖[1].𝐴
    𝗚⁻¹[1] =   36.0/𝐴
    𝗚⁻¹[2] = -120.0/𝐴
    𝗚⁻¹[3] =  600.0/𝐴
    𝗚⁻¹[4] = -120.0/𝐴
    𝗚⁻¹[5] =  300.0/𝐴
    𝗚⁻¹[6] =  600.0/𝐴
    𝗚⁻¹[7] =   90.0/𝐴
    𝗚⁻¹[8] = -540.0/𝐴
    𝗚⁻¹[9] = -180.0/𝐴
    𝗚⁻¹[10] =  540.0/𝐴
    𝗚⁻¹[11] =  180.0/𝐴
    𝗚⁻¹[12] = -720.0/𝐴
    𝗚⁻¹[13] = -720.0/𝐴
    𝗚⁻¹[14] =  540.0/𝐴
    𝗚⁻¹[15] = 1440.0/𝐴
    𝗚⁻¹[16] =   90.0/𝐴
    𝗚⁻¹[17] = -180.0/𝐴
    𝗚⁻¹[18] = -540.0/𝐴
    𝗚⁻¹[19] =   90.0/𝐴
    𝗚⁻¹[20] =  540.0/𝐴
    𝗚⁻¹[21] =  540.0/𝐴
    return 𝗚⁻¹
end

function cal∇𝗚₂!(ap::ReproducingKernel{:Quartic2D,𝑠,𝜙,:Tri3}) where {𝑠,𝜙}
    𝗚⁻¹ = get𝗚(ap,:∇̃²)
    𝗚⁻¹∂ξ = get𝗚(ap,:∂∇̃²∂ξ)
    𝗚⁻¹∂η = get𝗚(ap,:∂∇̃²∂η)
    𝐴 = ap.𝓖[1].𝐴
    𝗚⁻¹[1] =   36.0/𝐴
    𝗚⁻¹[2] = -120.0/𝐴
    𝗚⁻¹[3] =  600.0/𝐴
    𝗚⁻¹[4] = -120.0/𝐴
    𝗚⁻¹[5] =  300.0/𝐴
    𝗚⁻¹[6] =  600.0/𝐴
    𝗚⁻¹[7] =   90.0/𝐴
    𝗚⁻¹[8] = -540.0/𝐴
    𝗚⁻¹[9] = -180.0/𝐴
    𝗚⁻¹[10] =  540.0/𝐴
    𝗚⁻¹[11] =  180.0/𝐴
    𝗚⁻¹[12] = -720.0/𝐴
    𝗚⁻¹[13] = -720.0/𝐴
    𝗚⁻¹[14] =  540.0/𝐴
    𝗚⁻¹[15] = 1440.0/𝐴
    𝗚⁻¹[16] =   90.0/𝐴
    𝗚⁻¹[17] = -180.0/𝐴
    𝗚⁻¹[18] = -540.0/𝐴
    𝗚⁻¹[19] =   90.0/𝐴
    𝗚⁻¹[20] =  540.0/𝐴
    𝗚⁻¹[21] =  540.0/𝐴

    𝗚⁻¹∂ξ[1] =   36.0/𝐴
    𝗚⁻¹∂ξ[2] = -120.0/𝐴
    𝗚⁻¹∂ξ[3] =  600.0/𝐴
    𝗚⁻¹∂ξ[4] = -120.0/𝐴
    𝗚⁻¹∂ξ[5] =  300.0/𝐴
    𝗚⁻¹∂ξ[6] =  600.0/𝐴
    𝗚⁻¹∂ξ[7] =   90.0/𝐴
    𝗚⁻¹∂ξ[8] = -540.0/𝐴
    𝗚⁻¹∂ξ[9] = -180.0/𝐴
    𝗚⁻¹∂ξ[10] =  540.0/𝐴
    𝗚⁻¹∂ξ[11] =  180.0/𝐴
    𝗚⁻¹∂ξ[12] = -720.0/𝐴
    𝗚⁻¹∂ξ[13] = -720.0/𝐴
    𝗚⁻¹∂ξ[14] =  540.0/𝐴
    𝗚⁻¹∂ξ[15] = 1440.0/𝐴
    𝗚⁻¹∂ξ[16] =   90.0/𝐴
    𝗚⁻¹∂ξ[17] = -180.0/𝐴
    𝗚⁻¹∂ξ[18] = -540.0/𝐴
    𝗚⁻¹∂ξ[19] =   90.0/𝐴
    𝗚⁻¹∂ξ[20] =  540.0/𝐴
    𝗚⁻¹∂ξ[21] =  540.0/𝐴

    𝗚⁻¹∂η[1] =   36.0/𝐴
    𝗚⁻¹∂η[2] = -120.0/𝐴
    𝗚⁻¹∂η[3] =  600.0/𝐴
    𝗚⁻¹∂η[4] = -120.0/𝐴
    𝗚⁻¹∂η[5] =  300.0/𝐴
    𝗚⁻¹∂η[6] =  600.0/𝐴
    𝗚⁻¹∂η[7] =   90.0/𝐴
    𝗚⁻¹∂η[8] = -540.0/𝐴
    𝗚⁻¹∂η[9] = -180.0/𝐴
    𝗚⁻¹∂η[10] =  540.0/𝐴
    𝗚⁻¹∂η[11] =  180.0/𝐴
    𝗚⁻¹∂η[12] = -720.0/𝐴
    𝗚⁻¹∂η[13] = -720.0/𝐴
    𝗚⁻¹∂η[14] =  540.0/𝐴
    𝗚⁻¹∂η[15] = 1440.0/𝐴
    𝗚⁻¹∂η[16] =   90.0/𝐴
    𝗚⁻¹∂η[17] = -180.0/𝐴
    𝗚⁻¹∂η[18] = -540.0/𝐴
    𝗚⁻¹∂η[19] =   90.0/𝐴
    𝗚⁻¹∂η[20] =  540.0/𝐴
    𝗚⁻¹∂η[21] =  540.0/𝐴

    return 𝗚⁻¹,𝗚⁻¹∂ξ,𝗚⁻¹∂η
end
function set∇̃²𝝭!(gp::ReproducingKernel{𝒑,𝑠,𝜙,:Tri3},ap::ReproducingKernel{𝒑,𝑠,𝜙,:Tri3}) where {𝒑,𝑠,𝜙}
    𝓒 = gp.𝓒
    𝓖 = gp.𝓖
    𝐴 = 𝓖[1].𝐴
    n₁₁ = ap.𝓖[1].D₁₁;n₂₁ = ap.𝓖[1].D₂₁;n₃₁ = ap.𝓖[1].D₃₁
    n₁₂ = ap.𝓖[1].D₁₂;n₂₂ = ap.𝓖[1].D₂₂;n₃₂ = ap.𝓖[1].D₃₂
    s₁₁ = -n₁₂;s₂₁ = -n₂₂;s₃₁ = -n₃₂
    s₁₂ =  n₁₁;s₂₂ =  n₂₁;s₃₂ =  n₃₁
    𝐿₁² = n₁₁^2+n₁₂^2
    𝐿₂² = n₂₁^2+n₂₂^2
    𝐿₃² = n₃₁^2+n₃₂^2
    for ξ̂ in 𝓖
        𝒒̂ = get𝒑₂(gp,ξ̂)
        𝗚⁻¹ = cal𝗚₂!(gp)
        𝒒̂ᵀ𝗚⁻¹ = 𝒒̂*𝗚⁻¹

        ∂²𝝭∂x² = ξ̂[:∂²𝝭∂x²]
        ∂²𝝭∂x∂y = ξ̂[:∂²𝝭∂x∂y]
        ∂²𝝭∂y² = ξ̂[:∂²𝝭∂y²]
        for i in 1:length(𝓒)
            ∂²𝝭∂x²[i] = 0.0
            ∂²𝝭∂x∂y[i] = 0.0
            ∂²𝝭∂y²[i] = 0.0
        end
        for ξ in ap.𝓖
            w = ξ.w
            wᵇ = ξ.wᵇ
            𝝭 = ξ[:𝝭]
            ∂𝝭∂x = ξ[:∂𝝭∂x]
            ∂𝝭∂y = ξ[:∂𝝭∂y]
            𝒒, ∂𝒒∂ξ, ∂𝒒∂η, ∂²𝒒∂ξ², ∂²𝒒∂ξ∂η, ∂²𝒒∂η² = get∇²𝒑₂(ap,ξ)

            𝒒̂ᵀ𝗚⁻¹𝒒 =  𝒒̂ᵀ𝗚⁻¹*𝒒
            𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ = 𝒒̂ᵀ𝗚⁻¹*∂𝒒∂ξ
            𝒒̂ᵀ𝗚⁻¹∂𝒒∂η = 𝒒̂ᵀ𝗚⁻¹*∂𝒒∂η
            𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ² = 𝒒̂ᵀ𝗚⁻¹*∂²𝒒∂ξ²
            𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ∂η = 𝒒̂ᵀ𝗚⁻¹*∂²𝒒∂ξ∂η
            𝒒̂ᵀ𝗚⁻¹∂²𝒒∂η² = 𝒒̂ᵀ𝗚⁻¹*∂²𝒒∂η²

            q₁₁ = 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ²*n₁₁*n₁₁ + 2*𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ∂η*n₁₁*n₂₁ + 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂η²*n₂₁*n₂₁
            q₁₂ = 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ²*n₁₁*n₁₂ + 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ∂η*(n₁₁*n₂₂+n₁₂*n₂₁) + 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂η²*n₂₁*n₂₂
            q₂₂ = 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ²*n₁₂*n₁₂ + 2*𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ∂η*n₁₂*n₂₂ + 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂η²*n₂₂*n₂₂

            q₁ = 𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ*n₁₁ + 𝒒̂ᵀ𝗚⁻¹∂𝒒∂η*n₂₁
            q₂ = 𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ*n₁₂ + 𝒒̂ᵀ𝗚⁻¹∂𝒒∂η*n₂₂

            q₁n₁ = 0.0;q₂n₂ = 0.0;q₁n₂ = 0.0;q₂n₁ = 0.0
            mn₁₁n₁ = 0.0;mn₁₁n₂ = 0.0;mn₁₂n₁ = 0.0;mn₁₂n₂ = 0.0;mn₂₂n₁ = 0.0;mn₂₂n₂ = 0.0
            ms₁₁ = 0.0;ms₁₂ = 0.0;ms₂₂ = 0.0
            Δms₁₁ = 0.0;Δms₁₂ = 0.0;Δms₂₂ = 0.0
            if ξ.ξ == 0.0
                q₁n₁ += q₁*n₁₁
                q₁n₂ += q₁*n₁₂
                q₂n₁ += q₂*n₁₁
                q₂n₂ += q₂*n₁₂
                mn₁₁n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₁*n₁₁*n₁₁/𝐿₁²
                mn₁₁n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₁*n₁₁*n₁₂/𝐿₁²
                mn₁₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₁*n₁₂*n₁₁/𝐿₁²
                mn₁₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₁*n₁₂*n₁₂/𝐿₁²
                mn₂₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₂*n₁₂*n₁₁/𝐿₁²
                mn₂₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₂*n₁₂*n₁₂/𝐿₁²
                ms₁₁ += (q₁*s₁₁+q₂*s₁₂)*n₁₁*s₁₁/𝐿₁²
                ms₁₂ += (q₁*s₁₁+q₂*s₁₂)*0.5*(n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²
                ms₂₂ += (q₁*s₁₁+q₂*s₁₂)*n₁₂*s₁₂/𝐿₁²
            end
            if  ξ.η == 0.0
                q₁n₁ += q₁*n₂₁
                q₁n₂ += q₁*n₂₂
                q₂n₁ += q₂*n₂₁
                q₂n₂ += q₂*n₂₂
                mn₁₁n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₁*n₂₁*n₂₁/𝐿₂²
                mn₁₁n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₁*n₂₁*n₂₂/𝐿₂²
                mn₁₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₁*n₂₂*n₂₁/𝐿₂²
                mn₁₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₁*n₂₂*n₂₂/𝐿₂²
                mn₂₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₂*n₂₂*n₂₁/𝐿₂²
                mn₂₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₂*n₂₂*n₂₂/𝐿₂²
                ms₁₁ += (q₁*s₂₁+q₂*s₂₂)*n₂₁*s₂₁/𝐿₂²
                ms₁₂ += (q₁*s₂₁+q₂*s₂₂)*0.5*(n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²
                ms₂₂ += (q₁*s₂₁+q₂*s₂₂)*n₂₂*s₂₂/𝐿₂²
            end
            if ξ.ξ+ξ.η ≈ 1.0
                q₁n₁ += q₁*n₃₁
                q₁n₂ += q₁*n₃₂
                q₂n₁ += q₂*n₃₁
                q₂n₂ += q₂*n₃₂
                mn₁₁n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₁*n₃₁*n₃₁/𝐿₃²
                mn₁₁n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₁*n₃₁*n₃₂/𝐿₃²
                mn₁₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₁*n₃₂*n₃₁/𝐿₃²
                mn₁₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₁*n₃₂*n₃₂/𝐿₃²
                mn₂₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₂*n₃₂*n₃₁/𝐿₃²
                mn₂₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₂*n₃₂*n₃₂/𝐿₃²
                ms₁₁ += (q₁*s₃₁+q₂*s₃₂)*n₃₁*s₃₁/𝐿₃²
                ms₁₂ += (q₁*s₃₁+q₂*s₃₂)*0.5*(n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²
                ms₂₂ += (q₁*s₃₁+q₂*s₃₂)*n₃₂*s₃₂/𝐿₃²
            end
            if ξ.ξ == 1.0
                Δms₁₁ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₂₁*s₂₁/𝐿₂²-n₃₁*s₃₁/𝐿₃²)
                Δms₂₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₂₂*s₂₂/𝐿₂²-n₃₂*s₃₂/𝐿₃²)
                Δms₁₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*0.5*((n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²-(n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²)
            end
            if ξ.η == 1.0
                Δms₁₁ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₃₁*s₃₁/𝐿₃²-n₁₁*s₁₁/𝐿₁²)
                Δms₂₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₃₂*s₃₂/𝐿₃²-n₁₂*s₁₂/𝐿₁²)
                Δms₁₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*0.5*((n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²-(n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²)
            end
            if ξ.ξ+ξ.η ≈ 0.0
                Δms₁₁ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₁₁*s₁₁/𝐿₁²-n₂₁*s₂₁/𝐿₂²)
                Δms₂₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₁₂*s₁₂/𝐿₁²-n₂₂*s₂₂/𝐿₂²)
                Δms₁₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*0.5*((n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²-(n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²)
            end

            W₁₁₁ = mn₁₁n₁*wᵇ
            W₁₁₂ = mn₁₁n₂*wᵇ
            W₁₂₁ = mn₁₂n₁*wᵇ
            W₁₂₂ = mn₁₂n₂*wᵇ
            W₂₂₁ = mn₂₂n₁*wᵇ
            W₂₂₂ = mn₂₂n₂*wᵇ
            W₁₁ = (q₁₁*w + 2*(q₁n₁+ms₁₁)*wᵇ)/4/𝐴 + Δms₁₁
            W₁₂ = (q₁₂*w + (q₁n₂+q₂n₁+2*ms₁₂)*wᵇ)/4/𝐴 + Δms₁₂
            W₂₂ = (q₂₂*w + 2*(q₂n₂+ms₂₂)*wᵇ)/4/𝐴 + Δms₂₂
            for i in 1:length(𝓒)
                ∂²𝝭∂x²[i] += 𝝭[i]*W₁₁ + ∂𝝭∂x[i]*W₁₁₁ + ∂𝝭∂y[i]*W₁₁₂
                ∂²𝝭∂x∂y[i] += 𝝭[i]*W₁₂ + ∂𝝭∂x[i]*W₁₂₁ + ∂𝝭∂y[i]*W₁₂₂
                ∂²𝝭∂y²[i] += 𝝭[i]*W₂₂ + ∂𝝭∂x[i]*W₂₂₁ + ∂𝝭∂y[i]*W₂₂₂
            end
        end
    end
end

function set∇∇̃²𝝭!(gp::ReproducingKernel{𝒑,𝑠,𝜙,:Tri3},ap::ReproducingKernel{𝒑,𝑠,𝜙,:Tri3}) where {𝒑,𝑠,𝜙}
    x₁ = ap.𝓒[1].x;y₁ = ap.𝓒[1].y
    x₂ = ap.𝓒[2].x;y₂ = ap.𝓒[2].y
    x₃ = ap.𝓒[3].x;y₃ = ap.𝓒[3].y
    𝐴 = get𝐴(ap)
    n₁₁ = y₃-y₂;n₂₁ = y₁-y₃;n₃₁ = y₂-y₁
    n₁₂ = x₂-x₃;n₂₂ = x₃-x₁;n₃₂ = x₁-x₂
    s₁₁ = -n₁₂;s₂₁ = -n₂₂;s₃₁ = -n₃₂
    s₁₂ =  n₁₁;s₂₂ =  n₂₁;s₃₂ =  n₃₁
    𝐿₁² = n₁₁^2+n₁₂^2
    𝐿₂² = n₂₁^2+n₂₂^2
    𝐿₃² = n₃₁^2+n₃₂^2
    𝓒 = gp.𝓒
    𝓖 = gp.𝓖
    for ξ̂ in 𝓖
        𝒒̂,∂𝒒̂∂ξ,∂𝒒̂∂η = get∇𝒑₂(gp,ξ̂)
        𝗚⁻¹,𝗚⁻¹∂ξ,𝗚⁻¹∂η = cal∇𝗚₂!(gp)
        𝒒̂ᵀ𝗚⁻¹ = 𝒒̂*𝗚⁻¹
        ∂𝒒̂ᵀ∂ξ𝗚⁻¹ = ∂𝒒̂∂ξ*𝗚⁻¹∂ξ
        ∂𝒒̂ᵀ∂η𝗚⁻¹ = ∂𝒒̂∂η*𝗚⁻¹∂η

        ∂²𝝭∂x² = ξ̂[:∂²𝝭∂x²]
        ∂²𝝭∂x∂y = ξ̂[:∂²𝝭∂x∂y]
        ∂²𝝭∂y² = ξ̂[:∂²𝝭∂y²]
        ∂∂²𝝭∂x²∂x = ξ̂[:∂∂²𝝭∂x²∂x]
        ∂∂²𝝭∂x²∂y = ξ̂[:∂∂²𝝭∂x²∂y]
        ∂∂²𝝭∂x∂y∂x = ξ̂[:∂∂²𝝭∂x∂y∂x]
        ∂∂²𝝭∂x∂y∂y = ξ̂[:∂∂²𝝭∂x∂y∂y]
        ∂∂²𝝭∂y²∂x = ξ̂[:∂∂²𝝭∂y²∂x]
        ∂∂²𝝭∂y²∂y = ξ̂[:∂∂²𝝭∂y²∂y]
        for i in 1:length(𝓒)
            ∂²𝝭∂x²[i] = 0.0
            ∂²𝝭∂x∂y[i] = 0.0
            ∂²𝝭∂y²[i] = 0.0
            ∂∂²𝝭∂x²∂x[i] = 0.0
            ∂∂²𝝭∂x²∂y[i] = 0.0
            ∂∂²𝝭∂x∂y∂x[i] = 0.0
            ∂∂²𝝭∂x∂y∂y[i] = 0.0
            ∂∂²𝝭∂y²∂x[i] = 0.0
            ∂∂²𝝭∂y²∂y[i] = 0.0
        end

        for ξ in ap.𝓖
            w = ξ.w
            wᵇ = ξ.wᵇ
            𝝭 = ξ[:𝝭]
            ∂𝝭∂x = ξ[:∂𝝭∂x]
            ∂𝝭∂y = ξ[:∂𝝭∂y]
            𝒒, ∂𝒒∂ξ, ∂𝒒∂η, ∂²𝒒∂ξ², ∂²𝒒∂ξ∂η, ∂²𝒒∂η² = get∇²𝒑₂(ap,ξ)

            𝒒̂ᵀ𝗚⁻¹𝒒 =  𝒒̂ᵀ𝗚⁻¹*𝒒
            𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ = 𝒒̂ᵀ𝗚⁻¹*∂𝒒∂ξ
            𝒒̂ᵀ𝗚⁻¹∂𝒒∂η = 𝒒̂ᵀ𝗚⁻¹*∂𝒒∂η
            𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ² = 𝒒̂ᵀ𝗚⁻¹*∂²𝒒∂ξ²
            𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ∂η = 𝒒̂ᵀ𝗚⁻¹*∂²𝒒∂ξ∂η
            𝒒̂ᵀ𝗚⁻¹∂²𝒒∂η² = 𝒒̂ᵀ𝗚⁻¹*∂²𝒒∂η²

            ∂𝒒̂ᵀ∂ξ𝗚⁻¹𝒒 =  ∂𝒒̂ᵀ∂ξ𝗚⁻¹*𝒒
            ∂𝒒̂ᵀ∂η𝗚⁻¹𝒒 =  ∂𝒒̂ᵀ∂η𝗚⁻¹*𝒒
            ∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂ξ = ∂𝒒̂ᵀ∂ξ𝗚⁻¹*∂𝒒∂ξ
            ∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂ξ = ∂𝒒̂ᵀ∂η𝗚⁻¹*∂𝒒∂ξ
            ∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂η = ∂𝒒̂ᵀ∂ξ𝗚⁻¹*∂𝒒∂η
            ∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂η = ∂𝒒̂ᵀ∂η𝗚⁻¹*∂𝒒∂η
            ∂𝒒̂ᵀ∂ξ𝗚⁻¹∂²𝒒∂ξ² = ∂𝒒̂ᵀ∂ξ𝗚⁻¹*∂²𝒒∂ξ²
            ∂𝒒̂ᵀ∂η𝗚⁻¹∂²𝒒∂ξ² = ∂𝒒̂ᵀ∂η𝗚⁻¹*∂²𝒒∂ξ²
            ∂𝒒̂ᵀ∂ξ𝗚⁻¹∂²𝒒∂ξ∂η = ∂𝒒̂ᵀ∂ξ𝗚⁻¹*∂²𝒒∂ξ∂η
            ∂𝒒̂ᵀ∂η𝗚⁻¹∂²𝒒∂ξ∂η = ∂𝒒̂ᵀ∂η𝗚⁻¹*∂²𝒒∂ξ∂η
            ∂𝒒̂ᵀ∂ξ𝗚⁻¹∂²𝒒∂η² = ∂𝒒̂ᵀ∂ξ𝗚⁻¹*∂²𝒒∂η²
            ∂𝒒̂ᵀ∂η𝗚⁻¹∂²𝒒∂η² = ∂𝒒̂ᵀ∂η𝗚⁻¹*∂²𝒒∂η²

            ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒 = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹𝒒*n₁₁+∂𝒒̂ᵀ∂η𝗚⁻¹𝒒*n₂₁)/2/𝐴
            ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒 = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹𝒒*n₁₂+∂𝒒̂ᵀ∂η𝗚⁻¹𝒒*n₂₂)/2/𝐴
            ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂ξ = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂ξ*n₁₁+∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂ξ*n₂₁)/2/𝐴
            ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂ξ = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂ξ*n₁₂+∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂ξ*n₂₂)/2/𝐴
            ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂η = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂η*n₁₁+∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂η*n₂₁)/2/𝐴
            ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂η = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂η*n₁₂+∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂η*n₂₂)/2/𝐴
            ∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂ξ²  = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂²𝒒∂ξ²*n₁₁+∂𝒒̂ᵀ∂η𝗚⁻¹∂²𝒒∂ξ²*n₂₁)/2/𝐴
            ∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂ξ²  = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂²𝒒∂ξ²*n₁₂+∂𝒒̂ᵀ∂η𝗚⁻¹∂²𝒒∂ξ²*n₂₂)/2/𝐴
            ∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂ξ∂η = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂²𝒒∂ξ∂η*n₁₁+∂𝒒̂ᵀ∂η𝗚⁻¹∂²𝒒∂ξ∂η*n₂₁)/2/𝐴
            ∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂ξ∂η = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂²𝒒∂ξ∂η*n₁₂+∂𝒒̂ᵀ∂η𝗚⁻¹∂²𝒒∂ξ∂η*n₂₂)/2/𝐴
            ∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂η²  = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂²𝒒∂η²*n₁₁+∂𝒒̂ᵀ∂η𝗚⁻¹∂²𝒒∂η²*n₂₁)/2/𝐴
            ∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂η²  = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂²𝒒∂η²*n₁₂+∂𝒒̂ᵀ∂η𝗚⁻¹∂²𝒒∂η²*n₂₂)/2/𝐴

            q₁₁ = 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ²*n₁₁*n₁₁ + 2*𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ∂η*n₁₁*n₂₁ + 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂η²*n₂₁*n₂₁
            ∂q₁₁∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂ξ²*n₁₁*n₁₁ + 2*∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂ξ∂η*n₁₁*n₂₁ + ∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂η²*n₂₁*n₂₁
            ∂q₁₁∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂ξ²*n₁₁*n₁₁ + 2*∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂ξ∂η*n₁₁*n₂₁ + ∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂η²*n₂₁*n₂₁

            q₁₂ = 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ²*n₁₁*n₁₂ + 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ∂η*(n₁₁*n₂₂+n₁₂*n₂₁) + 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂η²*n₂₁*n₂₂
            ∂q₁₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂ξ²*n₁₁*n₁₂ + ∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂ξ∂η*(n₁₁*n₂₂+n₁₂*n₂₁) + ∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂η²*n₂₁*n₂₂
            ∂q₁₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂ξ²*n₁₁*n₁₂ + ∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂ξ∂η*(n₁₁*n₂₂+n₁₂*n₂₁) + ∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂η²*n₂₁*n₂₂

            q₂₂ = 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ²*n₁₂*n₁₂ + 2*𝒒̂ᵀ𝗚⁻¹∂²𝒒∂ξ∂η*n₁₂*n₂₂ + 𝒒̂ᵀ𝗚⁻¹∂²𝒒∂η²*n₂₂*n₂₂
            ∂q₂₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂ξ²*n₁₂*n₁₂ + 2*∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂ξ∂η*n₁₂*n₂₂ + ∂𝒒̂ᵀ∂x𝗚⁻¹∂²𝒒∂η²*n₂₂*n₂₂
            ∂q₂₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂ξ²*n₁₂*n₁₂ + 2*∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂ξ∂η*n₁₂*n₂₂ + ∂𝒒̂ᵀ∂y𝗚⁻¹∂²𝒒∂η²*n₂₂*n₂₂

            q₁ = 𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ*n₁₁ + 𝒒̂ᵀ𝗚⁻¹∂𝒒∂η*n₂₁
            ∂q₁∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂ξ*n₁₁ + ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂η*n₂₁
            ∂q₁∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂ξ*n₁₁ + ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂η*n₂₁
            q₂ = 𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ*n₁₂ + 𝒒̂ᵀ𝗚⁻¹∂𝒒∂η*n₂₂
            ∂q₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂ξ*n₁₂ + ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂η*n₂₂
            ∂q₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂ξ*n₁₂ + ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂η*n₂₂

            q₁n₁ = 0.0;q₂n₂ = 0.0;q₁n₂ = 0.0;q₂n₁ = 0.0
            ∂q₁∂xn₁ = 0.0;∂q₂∂xn₂ = 0.0;∂q₁∂xn₂ = 0.0;∂q₂∂xn₁ = 0.0
            ∂q₁∂yn₁ = 0.0;∂q₂∂yn₂ = 0.0;∂q₁∂yn₂ = 0.0;∂q₂∂yn₁ = 0.0
            mn₁₁n₁ = 0.0;mn₁₁n₂ = 0.0;mn₁₂n₁ = 0.0;mn₁₂n₂ = 0.0;mn₂₂n₁ = 0.0;mn₂₂n₂ = 0.0
            ∂mn₁₁∂xn₁ = 0.0;∂mn₁₁∂xn₂ = 0.0;∂mn₁₂∂xn₁ = 0.0;∂mn₁₂∂xn₂ = 0.0;∂mn₂₂∂xn₁ = 0.0;∂mn₂₂∂xn₂ = 0.0
            ∂mn₁₁∂yn₁ = 0.0;∂mn₁₁∂yn₂ = 0.0;∂mn₁₂∂yn₁ = 0.0;∂mn₁₂∂yn₂ = 0.0;∂mn₂₂∂yn₁ = 0.0;∂mn₂₂∂yn₂ = 0.0
            ms₁₁ = 0.0;ms₁₂ = 0.0;ms₂₂ = 0.0
            ∂ms₁₁∂x = 0.0;∂ms₁₂∂x = 0.0;∂ms₂₂∂x = 0.0
            ∂ms₁₁∂y = 0.0;∂ms₁₂∂y = 0.0;∂ms₂₂∂y = 0.0
            Δms₁₁ = 0.0;Δms₁₂ = 0.0;Δms₂₂ = 0.0
            Δ∂ms₁₁∂x = 0.0;Δ∂ms₁₂∂x = 0.0;Δ∂ms₂₂∂x = 0.0
            Δ∂ms₁₁∂y = 0.0;Δ∂ms₁₂∂y = 0.0;Δ∂ms₂₂∂y = 0.0
            if ξ.ξ == 0.0
                q₁n₁ += q₁*n₁₁
                q₁n₂ += q₁*n₁₂
                q₂n₁ += q₂*n₁₁
                q₂n₂ += q₂*n₁₂
                mn₁₁n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₁*n₁₁*n₁₁/𝐿₁²
                mn₁₁n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₁*n₁₁*n₁₂/𝐿₁²
                mn₁₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₁*n₁₂*n₁₁/𝐿₁²
                mn₁₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₁*n₁₂*n₁₂/𝐿₁²
                mn₂₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₂*n₁₂*n₁₁/𝐿₁²
                mn₂₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₁₂*n₁₂*n₁₂/𝐿₁²
                ms₁₁ += (q₁*s₁₁+q₂*s₁₂)*n₁₁*s₁₁/𝐿₁²
                ms₁₂ += (q₁*s₁₁+q₂*s₁₂)*0.5*(n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²
                ms₂₂ += (q₁*s₁₁+q₂*s₁₂)*n₁₂*s₁₂/𝐿₁²

                ∂q₁∂xn₁ += ∂q₁∂x*n₁₁
                ∂q₁∂yn₁ += ∂q₁∂y*n₁₁
                ∂q₁∂xn₂ += ∂q₁∂x*n₁₂
                ∂q₁∂yn₂ += ∂q₁∂y*n₁₂
                ∂q₂∂xn₁ += ∂q₂∂x*n₁₁
                ∂q₂∂yn₁ += ∂q₂∂y*n₁₁
                ∂q₂∂xn₂ += ∂q₂∂x*n₁₂
                ∂q₂∂yn₂ += ∂q₂∂y*n₁₂
                ∂mn₁₁∂xn₁ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₁₁*n₁₁*n₁₁/𝐿₁²
                ∂mn₁₁∂yn₁ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₁₁*n₁₁*n₁₁/𝐿₁²
                ∂mn₁₁∂xn₂ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₁₁*n₁₁*n₁₂/𝐿₁²
                ∂mn₁₁∂yn₂ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₁₁*n₁₁*n₁₂/𝐿₁²
                ∂mn₁₂∂xn₁ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₁₁*n₁₂*n₁₁/𝐿₁²
                ∂mn₁₂∂yn₁ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₁₁*n₁₂*n₁₁/𝐿₁²
                ∂mn₁₂∂xn₂ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₁₁*n₁₂*n₁₂/𝐿₁²
                ∂mn₁₂∂yn₂ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₁₁*n₁₂*n₁₂/𝐿₁²
                ∂mn₂₂∂xn₁ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₁₂*n₁₂*n₁₁/𝐿₁²
                ∂mn₂₂∂yn₁ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₁₂*n₁₂*n₁₁/𝐿₁²
                ∂mn₂₂∂xn₂ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₁₂*n₁₂*n₁₂/𝐿₁²
                ∂mn₂₂∂yn₂ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₁₂*n₁₂*n₁₂/𝐿₁²
                ∂ms₁₁∂x += (∂q₁∂x*s₁₁+∂q₂∂x*s₁₂)*n₁₁*s₁₁/𝐿₁²
                ∂ms₁₁∂y += (∂q₁∂y*s₁₁+∂q₂∂y*s₁₂)*n₁₁*s₁₁/𝐿₁²
                ∂ms₁₂∂x += (∂q₁∂x*s₁₁+∂q₂∂x*s₁₂)*0.5*(n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²
                ∂ms₁₂∂y += (∂q₁∂y*s₁₁+∂q₂∂y*s₁₂)*0.5*(n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²
                ∂ms₂₂∂x += (∂q₁∂x*s₁₁+∂q₂∂x*s₁₂)*n₁₂*s₁₂/𝐿₁²
                ∂ms₂₂∂y += (∂q₁∂y*s₁₁+∂q₂∂y*s₁₂)*n₁₂*s₁₂/𝐿₁²
                if ξ.η == 0.0
                    Δms₁₁ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₁₁*s₁₁/𝐿₁²-n₂₁*s₂₁/𝐿₂²)
                    Δms₂₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₁₂*s₁₂/𝐿₁²-n₂₂*s₂₂/𝐿₂²)
                    Δms₁₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*0.5*((n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²-(n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²)

                    Δ∂ms₁₁∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*(n₁₁*s₁₁/𝐿₁²-n₂₁*s₂₁/𝐿₂²)
                    Δ∂ms₁₁∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*(n₁₁*s₁₁/𝐿₁²-n₂₁*s₂₁/𝐿₂²)
                    Δ∂ms₂₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*(n₁₂*s₁₂/𝐿₁²-n₂₂*s₂₂/𝐿₂²)
                    Δ∂ms₂₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*(n₁₂*s₁₂/𝐿₁²-n₂₂*s₂₂/𝐿₂²)
                    Δ∂ms₁₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*0.5*((n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²-(n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²)
                    Δ∂ms₁₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*0.5*((n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²-(n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²)
                end
            end
            if  ξ.η == 0.0
                q₁n₁ += q₁*n₂₁
                q₁n₂ += q₁*n₂₂
                q₂n₁ += q₂*n₂₁
                q₂n₂ += q₂*n₂₂
                mn₁₁n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₁*n₂₁*n₂₁/𝐿₂²
                mn₁₁n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₁*n₂₁*n₂₂/𝐿₂²
                mn₁₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₁*n₂₂*n₂₁/𝐿₂²
                mn₁₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₁*n₂₂*n₂₂/𝐿₂²
                mn₂₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₂*n₂₂*n₂₁/𝐿₂²
                mn₂₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₂₂*n₂₂*n₂₂/𝐿₂²
                ms₁₁ += (q₁*s₂₁+q₂*s₂₂)*n₂₁*s₂₁/𝐿₂²
                ms₁₂ += (q₁*s₂₁+q₂*s₂₂)*0.5*(n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²
                ms₂₂ += (q₁*s₂₁+q₂*s₂₂)*n₂₂*s₂₂/𝐿₂²

                ∂q₁∂xn₁ += ∂q₁∂x*n₂₁
                ∂q₁∂yn₁ += ∂q₁∂y*n₂₁
                ∂q₁∂xn₂ += ∂q₁∂x*n₂₂
                ∂q₁∂yn₂ += ∂q₁∂y*n₂₂
                ∂q₂∂xn₁ += ∂q₂∂x*n₂₁
                ∂q₂∂yn₁ += ∂q₂∂y*n₂₁
                ∂q₂∂xn₂ += ∂q₂∂x*n₂₂
                ∂q₂∂yn₂ += ∂q₂∂y*n₂₂
                ∂mn₁₁∂xn₁ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₂₁*n₂₁*n₂₁/𝐿₂²
                ∂mn₁₁∂yn₁ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₂₁*n₂₁*n₂₁/𝐿₂²
                ∂mn₁₁∂xn₂ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₂₁*n₂₁*n₂₂/𝐿₂²
                ∂mn₁₁∂yn₂ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₂₁*n₂₁*n₂₂/𝐿₂²
                ∂mn₁₂∂xn₁ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₂₁*n₂₂*n₂₁/𝐿₂²
                ∂mn₁₂∂yn₁ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₂₁*n₂₂*n₂₁/𝐿₂²
                ∂mn₁₂∂xn₂ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₂₁*n₂₂*n₂₂/𝐿₂²
                ∂mn₁₂∂yn₂ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₂₁*n₂₂*n₂₂/𝐿₂²
                ∂mn₂₂∂xn₁ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₂₂*n₂₂*n₂₁/𝐿₂²
                ∂mn₂₂∂yn₁ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₂₂*n₂₂*n₂₁/𝐿₂²
                ∂mn₂₂∂xn₂ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₂₂*n₂₂*n₂₂/𝐿₂²
                ∂mn₂₂∂yn₂ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₂₂*n₂₂*n₂₂/𝐿₂²
                ∂ms₁₁∂x += (∂q₁∂x*s₂₁+∂q₂∂x*s₂₂)*n₂₁*s₂₁/𝐿₂²
                ∂ms₁₁∂y += (∂q₁∂y*s₂₁+∂q₂∂y*s₂₂)*n₂₁*s₂₁/𝐿₂²
                ∂ms₁₂∂x += (∂q₁∂x*s₂₁+∂q₂∂x*s₂₂)*0.5*(n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²
                ∂ms₁₂∂y += (∂q₁∂y*s₂₁+∂q₂∂y*s₂₂)*0.5*(n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²
                ∂ms₂₂∂x += (∂q₁∂x*s₂₁+∂q₂∂x*s₂₂)*n₂₂*s₂₂/𝐿₂²
                ∂ms₂₂∂y += (∂q₁∂y*s₂₁+∂q₂∂y*s₂₂)*n₂₂*s₂₂/𝐿₂²

                if ξ.ξ+ξ.η ≈ 1.0
                    Δms₁₁ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₂₁*s₂₁/𝐿₂²-n₃₁*s₃₁/𝐿₃²)
                    Δms₂₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₂₂*s₂₂/𝐿₂²-n₃₂*s₃₂/𝐿₃²)
                    Δms₁₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*0.5*((n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²-(n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²)

                    Δ∂ms₁₁∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*(n₂₁*s₂₁/𝐿₂²-n₃₁*s₃₁/𝐿₃²)
                    Δ∂ms₁₁∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*(n₂₁*s₂₁/𝐿₂²-n₃₁*s₃₁/𝐿₃²)
                    Δ∂ms₂₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*(n₂₂*s₂₂/𝐿₂²-n₃₂*s₃₂/𝐿₃²)
                    Δ∂ms₂₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*(n₂₂*s₂₂/𝐿₂²-n₃₂*s₃₂/𝐿₃²)
                    Δ∂ms₁₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*0.5*((n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²-(n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²)
                    Δ∂ms₁₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*0.5*((n₂₁*s₂₂+n₂₂*s₂₁)/𝐿₂²-(n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²)
                end
            end
            if ξ.ξ+ξ.η ≈ 1.0
                q₁n₁ += q₁*n₃₁
                q₁n₂ += q₁*n₃₂
                q₂n₁ += q₂*n₃₁
                q₂n₂ += q₂*n₃₂
                mn₁₁n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₁*n₃₁*n₃₁/𝐿₃²
                mn₁₁n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₁*n₃₁*n₃₂/𝐿₃²
                mn₁₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₁*n₃₂*n₃₁/𝐿₃²
                mn₁₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₁*n₃₂*n₃₂/𝐿₃²
                mn₂₂n₁ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₂*n₃₂*n₃₁/𝐿₃²
                mn₂₂n₂ += 𝒒̂ᵀ𝗚⁻¹𝒒*n₃₂*n₃₂*n₃₂/𝐿₃²
                ms₁₁ += (q₁*s₃₁+q₂*s₃₂)*n₃₁*s₃₁/𝐿₃²
                ms₁₂ += (q₁*s₃₁+q₂*s₃₂)*0.5*(n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²
                ms₂₂ += (q₁*s₃₁+q₂*s₃₂)*n₃₂*s₃₂/𝐿₃²

                ∂q₁∂xn₁ += ∂q₁∂x*n₃₁
                ∂q₁∂yn₁ += ∂q₁∂y*n₃₁
                ∂q₁∂xn₂ += ∂q₁∂x*n₃₂
                ∂q₁∂yn₂ += ∂q₁∂y*n₃₂
                ∂q₂∂xn₁ += ∂q₂∂x*n₃₁
                ∂q₂∂yn₁ += ∂q₂∂y*n₃₁
                ∂q₂∂xn₂ += ∂q₂∂x*n₃₂
                ∂q₂∂yn₂ += ∂q₂∂y*n₃₂
                ∂mn₁₁∂xn₁ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₃₁*n₃₁*n₃₁/𝐿₃²
                ∂mn₁₁∂yn₁ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₃₁*n₃₁*n₃₁/𝐿₃²
                ∂mn₁₁∂xn₂ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₃₁*n₃₁*n₃₂/𝐿₃²
                ∂mn₁₁∂yn₂ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₃₁*n₃₁*n₃₂/𝐿₃²
                ∂mn₁₂∂xn₁ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₃₁*n₃₂*n₃₁/𝐿₃²
                ∂mn₁₂∂yn₁ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₃₁*n₃₂*n₃₁/𝐿₃²
                ∂mn₁₂∂xn₂ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₃₁*n₃₂*n₃₂/𝐿₃²
                ∂mn₁₂∂yn₂ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₃₁*n₃₂*n₃₂/𝐿₃²
                ∂mn₂₂∂xn₁ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₃₂*n₃₂*n₃₁/𝐿₃²
                ∂mn₂₂∂yn₁ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₃₂*n₃₂*n₃₁/𝐿₃²
                ∂mn₂₂∂xn₂ += ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₃₂*n₃₂*n₃₂/𝐿₃²
                ∂mn₂₂∂yn₂ += ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₃₂*n₃₂*n₃₂/𝐿₃²
                ∂ms₁₁∂x += (∂q₁∂x*s₃₁+∂q₂∂x*s₃₂)*n₃₁*s₃₁/𝐿₃²
                ∂ms₁₁∂y += (∂q₁∂y*s₃₁+∂q₂∂y*s₃₂)*n₃₁*s₃₁/𝐿₃²
                ∂ms₁₂∂x += (∂q₁∂x*s₃₁+∂q₂∂x*s₃₂)*0.5*(n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²
                ∂ms₁₂∂y += (∂q₁∂y*s₃₁+∂q₂∂y*s₃₂)*0.5*(n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²
                ∂ms₂₂∂x += (∂q₁∂x*s₃₁+∂q₂∂x*s₃₂)*n₃₂*s₃₂/𝐿₃²
                ∂ms₂₂∂y += (∂q₁∂y*s₃₁+∂q₂∂y*s₃₂)*n₃₂*s₃₂/𝐿₃²
                if ξ.ξ == 0.0
                    Δms₁₁ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₃₁*s₃₁/𝐿₃²-n₁₁*s₁₁/𝐿₁²)
                    Δms₂₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*(n₃₂*s₃₂/𝐿₃²-n₁₂*s₁₂/𝐿₁²)
                    Δms₁₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*0.5*((n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²-(n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²)

                    Δ∂ms₁₁∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*(n₃₁*s₃₁/𝐿₃²-n₁₁*s₁₁/𝐿₁²)
                    Δ∂ms₁₁∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*(n₃₁*s₃₁/𝐿₃²-n₁₁*s₁₁/𝐿₁²)
                    Δ∂ms₂₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*(n₃₂*s₃₂/𝐿₃²-n₁₂*s₁₂/𝐿₁²)
                    Δ∂ms₂₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*(n₃₂*s₃₂/𝐿₃²-n₁₂*s₁₂/𝐿₁²)
                    Δ∂ms₁₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*0.5*((n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²-(n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²)
                    Δ∂ms₁₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*0.5*((n₃₁*s₃₂+n₃₂*s₃₁)/𝐿₃²-(n₁₁*s₁₂+n₁₂*s₁₁)/𝐿₁²)
                end
            end

            W₁₁₁ = mn₁₁n₁*wᵇ
            W₁₁₂ = mn₁₁n₂*wᵇ
            W₁₂₁ = mn₁₂n₁*wᵇ
            W₁₂₂ = mn₁₂n₂*wᵇ
            W₂₂₁ = mn₂₂n₁*wᵇ
            W₂₂₂ = mn₂₂n₂*wᵇ
            W₁₁ = (q₁₁*w + 2*(q₁n₁+ms₁₁)*wᵇ)/4/𝐴 + Δms₁₁
            W₁₂ = (q₁₂*w + (q₁n₂+q₂n₁+2*ms₁₂)*wᵇ)/4/𝐴 + Δms₁₂
            W₂₂ = (q₂₂*w + 2*(q₂n₂+ms₂₂)*wᵇ)/4/𝐴 + Δms₂₂

            ∂W₁₁₁∂x = ∂mn₁₁∂xn₁*wᵇ
            ∂W₁₁₁∂y = ∂mn₁₁∂yn₁*wᵇ
            ∂W₁₁₂∂x = ∂mn₁₁∂xn₂*wᵇ
            ∂W₁₁₂∂y = ∂mn₁₁∂yn₂*wᵇ
            ∂W₁₂₁∂x = ∂mn₁₂∂xn₁*wᵇ
            ∂W₁₂₁∂y = ∂mn₁₂∂yn₁*wᵇ
            ∂W₁₂₂∂x = ∂mn₁₂∂xn₂*wᵇ
            ∂W₁₂₂∂y = ∂mn₁₂∂yn₂*wᵇ
            ∂W₂₂₁∂x = ∂mn₂₂∂xn₁*wᵇ
            ∂W₂₂₁∂y = ∂mn₂₂∂yn₁*wᵇ
            ∂W₂₂₂∂x = ∂mn₂₂∂xn₂*wᵇ
            ∂W₂₂₂∂y = ∂mn₂₂∂yn₂*wᵇ
            ∂W₁₁∂x = (∂q₁₁∂x*w + 2*(∂q₁∂xn₁+∂ms₁₁∂x)*wᵇ)/4/𝐴 + Δ∂ms₁₁∂x
            ∂W₁₁∂y = (∂q₁₁∂y*w + 2*(∂q₁∂yn₁+∂ms₁₁∂y)*wᵇ)/4/𝐴 + Δ∂ms₁₁∂y
            ∂W₁₂∂x = (∂q₁₂∂x*w + (∂q₁∂xn₂+∂q₂∂xn₁+2*∂ms₁₂∂x)*wᵇ)/4/𝐴 + Δ∂ms₁₂∂x
            ∂W₁₂∂y = (∂q₁₂∂y*w + (∂q₁∂yn₂+∂q₂∂yn₁+2*∂ms₁₂∂y)*wᵇ)/4/𝐴 + Δ∂ms₁₂∂y
            ∂W₂₂∂x = (∂q₂₂∂x*w + 2*(∂q₂∂xn₂+∂ms₂₂∂x)*wᵇ)/4/𝐴 + Δ∂ms₂₂∂x
            ∂W₂₂∂y = (∂q₂₂∂y*w + 2*(∂q₂∂yn₂+∂ms₂₂∂y)*wᵇ)/4/𝐴 + Δ∂ms₂₂∂y
            for i in 1:length(𝓒)
                ∂²𝝭∂x²[i] += 𝝭[i]*W₁₁ + ∂𝝭∂x[i]*W₁₁₁ + ∂𝝭∂y[i]*W₁₁₂
                ∂²𝝭∂x∂y[i] += 𝝭[i]*W₁₂ + ∂𝝭∂x[i]*W₁₂₁ + ∂𝝭∂y[i]*W₁₂₂
                ∂²𝝭∂y²[i] += 𝝭[i]*W₂₂ + ∂𝝭∂x[i]*W₂₂₁ + ∂𝝭∂y[i]*W₂₂₂
                ∂∂²𝝭∂x²∂x[i] += 𝝭[i]*∂W₁₁∂x + ∂𝝭∂x[i]*∂W₁₁₁∂x + ∂𝝭∂y[i]*∂W₁₁₂∂x
                ∂∂²𝝭∂x²∂y[i] += 𝝭[i]*∂W₁₁∂y + ∂𝝭∂x[i]*∂W₁₁₁∂y + ∂𝝭∂y[i]*∂W₁₁₂∂y
                ∂∂²𝝭∂x∂y∂x[i] += 𝝭[i]*∂W₁₂∂x + ∂𝝭∂x[i]*∂W₁₂₁∂x + ∂𝝭∂y[i]*∂W₁₂₂∂x
                ∂∂²𝝭∂x∂y∂y[i] += 𝝭[i]*∂W₁₂∂y + ∂𝝭∂x[i]*∂W₁₂₁∂y + ∂𝝭∂y[i]*∂W₁₂₂∂y
                ∂∂²𝝭∂y²∂x[i] += 𝝭[i]*∂W₂₂∂x + ∂𝝭∂x[i]*∂W₂₂₁∂x + ∂𝝭∂y[i]*∂W₂₂₂∂x
                ∂∂²𝝭∂y²∂y[i] += 𝝭[i]*∂W₂₂∂y + ∂𝝭∂x[i]*∂W₂₂₁∂y + ∂𝝭∂y[i]*∂W₂₂₂∂y
            end
        end
    end
end

function set∇̄𝝭!(ap::ReproducingKernel{𝒑,𝑠,𝜙,:Seg2}) where {𝒑,𝑠,𝜙}
    𝓒 = ap.𝓒
    𝓖 = ap.𝓖
    for ξ̂ in 𝓖
        𝒒̂ = get𝒑₁(ap,ξ̂)
        𝗚⁻¹ = cal𝗚!(ap)
        𝒒̂ᵀ𝗚⁻¹ = 𝒒̂*𝗚⁻¹
        ∂𝝭∂x = ξ̂[:∂𝝭∂x_]
        fill!(∂𝝭∂x,0.0)
        for ξ in ap.𝓖
            w = ξ.w
            n = ξ.n₁
            𝝭 = ξ[:𝝭]
            𝒒 = get𝒑₁(ap,ξ)
            W₁ = 𝒒̂ᵀ𝗚⁻¹*𝒒*n*w
            for i in 1:length(𝓒)
                ∂𝝭∂x[i] += 𝝭[i]*W₁
            end
        end
    end
end

function set∇̄𝝭!(ap::ReproducingKernel{𝒑,𝑠,𝜙,:Tri3}) where {𝒑,𝑠,𝜙}
    𝓒 = ap.𝓒
    𝓖 = ap.𝓖
    for ξ̂ in 𝓖
        𝒒̂ = get𝒑₁(ap,ξ̂)
        𝗚⁻¹ = cal𝗚!(ap)
        𝒒̂ᵀ𝗚⁻¹ = 𝒒̂*𝗚⁻¹
        ∂𝝭∂x = ξ̂[:∂𝝭∂x_]
        ∂𝝭∂y = ξ̂[:∂𝝭∂y_]
        for i in 1:length(𝓒)
            ∂𝝭∂x[i] = 0.0
            ∂𝝭∂y[i] = 0.0
        end
        for ξ in ap.𝓖
            w = ξ.w
            n₁ = ξ.n₁
            n₂ = ξ.n₂
            𝝭 = ξ[:𝝭]
            𝒒 = get𝒑₁(ap,ξ)
            𝒒̂ᵀ𝗚⁻¹𝒒 = 𝒒̂ᵀ𝗚⁻¹*𝒒
            W₁ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₁*w
            W₂ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₂*w
            for i in 1:length(𝓒)
                ∂𝝭∂x[i] += 𝝭[i]*W₁
                ∂𝝭∂y[i] += 𝝭[i]*W₂
            end
        end
    end
end

function set∇∇̄²𝝭!(ap::ReproducingKernel{𝒑,𝑠,𝜙,:Tri3};Γᵍ::Union{ReproducingKernel{𝒑,𝑠,𝜙,:Tri3},Nothing}=nothing,Γᶿ::Union{ReproducingKernel{𝒑,𝑠,𝜙,:Tri3},Nothing}=nothing,Γᴾ::Vector{ReproducingKernel{𝒑,𝑠,𝜙,:Tri3}}=[]) where {𝒑,𝑠,𝜙}
    x₁ = ap.𝓒[1].x;y₁ = ap.𝓒[1].y
    x₂ = ap.𝓒[2].x;y₂ = ap.𝓒[2].y
    x₃ = ap.𝓒[3].x;y₃ = ap.𝓒[3].y
    𝐴 = get𝐴(ap)
    n₁₁ = y₃-y₂;n₂₁ = y₁-y₃;n₃₁ = y₂-y₁
    n₁₂ = x₂-x₃;n₂₂ = x₃-x₁;n₃₂ = x₁-x₂
    𝓒 = ap.𝓒
    𝓖 = ap.𝓖
    for ξ̂ in 𝓖
        𝒒̂,∂𝒒̂∂ξ,∂𝒒̂∂η = get∇𝒑₂(ap,ξ̂)
        𝗚⁻¹,𝗚⁻¹∂ξ,𝗚⁻¹∂η = cal∇𝗚₂!(ap)
        𝒒̂ᵀ𝗚⁻¹ = 𝒒̂*𝗚⁻¹
        ∂𝒒̂ᵀ∂ξ𝗚⁻¹ = ∂𝒒̂∂ξ*𝗚⁻¹∂ξ
        ∂𝒒̂ᵀ∂η𝗚⁻¹ = ∂𝒒̂∂η*𝗚⁻¹∂η

        ∂²𝝭∂x² = ξ̂[:∂²𝝭∂x²_]
        ∂²𝝭∂x∂y = ξ̂[:∂²𝝭∂x∂y_]
        ∂²𝝭∂y² = ξ̂[:∂²𝝭∂y²_]
        ∂∂²𝝭∂x²∂x = ξ̂[:∂∂²𝝭∂x²∂x_]
        ∂∂²𝝭∂x²∂y = ξ̂[:∂∂²𝝭∂x²∂y_]
        ∂∂²𝝭∂x∂y∂x = ξ̂[:∂∂²𝝭∂x∂y∂x_]
        ∂∂²𝝭∂x∂y∂y = ξ̂[:∂∂²𝝭∂x∂y∂y_]
        ∂∂²𝝭∂y²∂x = ξ̂[:∂∂²𝝭∂y²∂x_]
        ∂∂²𝝭∂y²∂y = ξ̂[:∂∂²𝝭∂y²∂y_]
        for i in 1:length(𝓒)
            ∂²𝝭∂x²[i] = 0.0
            ∂²𝝭∂x∂y[i] = 0.0
            ∂²𝝭∂y²[i] = 0.0
            ∂∂²𝝭∂x²∂x[i] = 0.0
            ∂∂²𝝭∂x²∂y[i] = 0.0
            ∂∂²𝝭∂x∂y∂x[i] = 0.0
            ∂∂²𝝭∂x∂y∂y[i] = 0.0
            ∂∂²𝝭∂y²∂x[i] = 0.0
            ∂∂²𝝭∂y²∂y[i] = 0.0
        end
        if Γᵍ ≠ nothing
            for ξ in Γᵍ.𝓖
                𝑤 = ξ.𝑤
                n₁ = ξ.n₁
                n₂ = ξ.n₂
                s₁ = -n₂
                s₂ = n₁
                𝝭 = ξ[:𝝭]
                𝒒, ∂𝒒∂ξ, ∂𝒒∂η = get∇²𝒑₂(Γᵍ,ξ)

                𝒒̂ᵀ𝗚⁻¹𝒒 =  𝒒̂ᵀ𝗚⁻¹*𝒒
                𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ = 𝒒̂ᵀ𝗚⁻¹*∂𝒒∂ξ
                𝒒̂ᵀ𝗚⁻¹∂𝒒∂η = 𝒒̂ᵀ𝗚⁻¹*∂𝒒∂η

                ∂𝒒̂ᵀ∂ξ𝗚⁻¹𝒒 =  ∂𝒒̂ᵀ∂ξ𝗚⁻¹*𝒒
                ∂𝒒̂ᵀ∂η𝗚⁻¹𝒒 =  ∂𝒒̂ᵀ∂η𝗚⁻¹*𝒒
                ∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂ξ = ∂𝒒̂ᵀ∂ξ𝗚⁻¹*∂𝒒∂ξ
                ∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂ξ = ∂𝒒̂ᵀ∂η𝗚⁻¹*∂𝒒∂ξ
                ∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂η = ∂𝒒̂ᵀ∂ξ𝗚⁻¹*∂𝒒∂η
                ∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂η = ∂𝒒̂ᵀ∂η𝗚⁻¹*∂𝒒∂η

                ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂ξ = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂ξ*n₁₁+∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂ξ*n₂₁)/2/𝐴
                ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂ξ = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂ξ*n₁₂+∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂ξ*n₂₂)/2/𝐴
                ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂η = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂η*n₁₁+∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂η*n₂₁)/2/𝐴
                ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂η = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹∂𝒒∂η*n₁₂+∂𝒒̂ᵀ∂η𝗚⁻¹∂𝒒∂η*n₂₂)/2/𝐴

                q₁ = 𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ*n₁₁ + 𝒒̂ᵀ𝗚⁻¹∂𝒒∂η*n₂₁
                ∂q₁∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂ξ*n₁₁ + ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂η*n₂₁
                ∂q₁∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂ξ*n₁₁ + ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂η*n₂₁
                q₂ = 𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ*n₁₂ + 𝒒̂ᵀ𝗚⁻¹∂𝒒∂η*n₂₂
                ∂q₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂ξ*n₁₂ + ∂𝒒̂ᵀ∂x𝗚⁻¹∂𝒒∂η*n₂₂
                ∂q₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂ξ*n₁₂ + ∂𝒒̂ᵀ∂y𝗚⁻¹∂𝒒∂η*n₂₂

                q₁n₁ = q₁*n₁
                q₁n₂ = q₁*n₂
                q₂n₁ = q₂*n₁
                q₂n₂ = q₂*n₂
                ms₁₁ = (q₁*s₁+q₂*s₂)*n₁*s₁
                ms₁₂ = (q₁*s₁+q₂*s₂)*0.5*(n₁*s₂+n₂*s₁)
                ms₂₂ = (q₁*s₁+q₂*s₂)*n₂*s₂

                ∂q₁∂xn₁ = ∂q₁∂x*n₁
                ∂q₁∂yn₁ = ∂q₁∂y*n₁
                ∂q₁∂xn₂ = ∂q₁∂x*n₂
                ∂q₁∂yn₂ = ∂q₁∂y*n₂
                ∂q₂∂xn₁ = ∂q₂∂x*n₁
                ∂q₂∂yn₁ = ∂q₂∂y*n₁
                ∂q₂∂xn₂ = ∂q₂∂x*n₂
                ∂q₂∂yn₂ = ∂q₂∂y*n₂
                ∂ms₁₁∂x = (∂q₁∂x*s₁+∂q₂∂x*s₂)*n₁*s₁
                ∂ms₁₁∂y = (∂q₁∂y*s₁+∂q₂∂y*s₂)*n₁*s₁
                ∂ms₁₂∂x = (∂q₁∂x*s₁+∂q₂∂x*s₂)*0.5*(n₁*s₂+n₂*s₁)
                ∂ms₁₂∂y = (∂q₁∂y*s₁+∂q₂∂y*s₂)*0.5*(n₁*s₂+n₂*s₁)
                ∂ms₂₂∂x = (∂q₁∂x*s₁+∂q₂∂x*s₂)*n₂*s₂
                ∂ms₂₂∂y = (∂q₁∂y*s₁+∂q₂∂y*s₂)*n₂*s₂

                W₁₁ = (q₁n₁+ms₁₁)*𝑤/2/𝐴
                W₁₂ = (q₁n₂+q₂n₁+2*ms₁₂)*𝑤/4/𝐴
                W₂₂ = (q₂n₂+ms₂₂)*𝑤/2/𝐴
                ∂W₁₁∂x = (∂q₁∂xn₁+∂ms₁₁∂x)*𝑤/2/𝐴
                ∂W₁₁∂y = (∂q₁∂yn₁+∂ms₁₁∂y)*𝑤/2/𝐴
                ∂W₁₂∂x = (∂q₁∂xn₂+∂q₂∂xn₁+2*∂ms₁₂∂x)*𝑤/4/𝐴
                ∂W₁₂∂y = (∂q₁∂yn₂+∂q₂∂yn₁+2*∂ms₁₂∂y)*𝑤/4/𝐴
                ∂W₂₂∂x = (∂q₂∂xn₂+∂ms₂₂∂x)*𝑤/2/𝐴
                ∂W₂₂∂y = (∂q₂∂yn₂+∂ms₂₂∂y)*𝑤/2/𝐴
                for i in 1:length(𝓒)
                    ∂²𝝭∂x²[i] += 𝝭[i]*W₁₁
                    ∂²𝝭∂x∂y[i] += 𝝭[i]*W₁₂
                    ∂²𝝭∂y²[i] += 𝝭[i]*W₂₂
                    ∂∂²𝝭∂x²∂x[i] += 𝝭[i]*∂W₁₁∂x
                    ∂∂²𝝭∂x²∂y[i] += 𝝭[i]*∂W₁₁∂y
                    ∂∂²𝝭∂x∂y∂x[i] += 𝝭[i]*∂W₁₂∂x
                    ∂∂²𝝭∂x∂y∂y[i] += 𝝭[i]*∂W₁₂∂y
                    ∂∂²𝝭∂y²∂x[i] += 𝝭[i]*∂W₂₂∂x
                    ∂∂²𝝭∂y²∂y[i] += 𝝭[i]*∂W₂₂∂y
                end
            end
        end

        if Γᶿ ≠ nothing
            for ξ in Γᶿ.𝓖
                𝑤 = ξ.𝑤
                n₁ = ξ.n₁
                n₂ = ξ.n₂
                s₁ = ξ.s₁
                s₂ = ξ.s₂
                ∂𝝭∂x = ξ[:∂𝝭∂x]
                ∂𝝭∂y = ξ[:∂𝝭∂y]
                𝒒 = get𝒑₂(Γᶿ,ξ)

                𝒒̂ᵀ𝗚⁻¹𝒒 =  𝒒̂ᵀ𝗚⁻¹*𝒒
                ∂𝒒̂ᵀ∂ξ𝗚⁻¹𝒒 =  ∂𝒒̂ᵀ∂ξ𝗚⁻¹*𝒒
                ∂𝒒̂ᵀ∂η𝗚⁻¹𝒒 =  ∂𝒒̂ᵀ∂η𝗚⁻¹*𝒒

                ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒 = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹𝒒*n₁₁+∂𝒒̂ᵀ∂η𝗚⁻¹𝒒*n₂₁)/2/𝐴
                ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒 = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹𝒒*n₁₂+∂𝒒̂ᵀ∂η𝗚⁻¹𝒒*n₂₂)/2/𝐴

                mn₁₁n₁ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₁*n₁*n₁
                mn₁₁n₂ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₁*n₁*n₂
                mn₁₂n₁ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₁*n₂*n₁
                mn₁₂n₂ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₁*n₂*n₂
                mn₂₂n₁ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₂*n₂*n₁
                mn₂₂n₂ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₂*n₂*n₂

                ∂mn₁₁∂xn₁ = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₁*n₁*n₁
                ∂mn₁₁∂yn₁ = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₁*n₁*n₁
                ∂mn₁₁∂xn₂ = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₁*n₁*n₂
                ∂mn₁₁∂yn₂ = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₁*n₁*n₂
                ∂mn₁₂∂xn₁ = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₁*n₂*n₁
                ∂mn₁₂∂yn₁ = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₁*n₂*n₁
                ∂mn₁₂∂xn₂ = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₁*n₂*n₂
                ∂mn₁₂∂yn₂ = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₁*n₂*n₂
                ∂mn₂₂∂xn₁ = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₂*n₂*n₁
                ∂mn₂₂∂yn₁ = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₂*n₂*n₁
                ∂mn₂₂∂xn₂ = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*n₂*n₂*n₂
                ∂mn₂₂∂yn₂ = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*n₂*n₂*n₂

                W₁₁₁ = mn₁₁n₁*𝑤
                W₁₁₂ = mn₁₁n₂*𝑤
                W₁₂₁ = mn₁₂n₁*𝑤
                W₁₂₂ = mn₁₂n₂*𝑤
                W₂₂₁ = mn₂₂n₁*𝑤
                W₂₂₂ = mn₂₂n₂*𝑤

                ∂W₁₁₁∂x = ∂mn₁₁∂xn₁*𝑤
                ∂W₁₁₁∂y = ∂mn₁₁∂yn₁*𝑤
                ∂W₁₁₂∂x = ∂mn₁₁∂xn₂*𝑤
                ∂W₁₁₂∂y = ∂mn₁₁∂yn₂*𝑤
                ∂W₁₂₁∂x = ∂mn₁₂∂xn₁*𝑤
                ∂W₁₂₁∂y = ∂mn₁₂∂yn₁*𝑤
                ∂W₁₂₂∂x = ∂mn₁₂∂xn₂*𝑤
                ∂W₁₂₂∂y = ∂mn₁₂∂yn₂*𝑤
                ∂W₂₂₁∂x = ∂mn₂₂∂xn₁*𝑤
                ∂W₂₂₁∂y = ∂mn₂₂∂yn₁*𝑤
                ∂W₂₂₂∂x = ∂mn₂₂∂xn₂*𝑤
                ∂W₂₂₂∂y = ∂mn₂₂∂yn₂*𝑤
                for i in 1:length(𝓒)
                    ∂²𝝭∂x²[i] += ∂𝝭∂x[i]*W₁₁₁ + ∂𝝭∂y[i]*W₁₁₂
                    ∂²𝝭∂x∂y[i] += ∂𝝭∂x[i]*W₁₂₁ + ∂𝝭∂y[i]*W₁₂₂
                    ∂²𝝭∂y²[i] += ∂𝝭∂x[i]*W₂₂₁ + ∂𝝭∂y[i]*W₂₂₂
                    ∂∂²𝝭∂x²∂x[i] += ∂𝝭∂x[i]*∂W₁₁₁∂x + ∂𝝭∂y[i]*∂W₁₁₂∂x
                    ∂∂²𝝭∂x²∂y[i] += ∂𝝭∂x[i]*∂W₁₁₁∂y + ∂𝝭∂y[i]*∂W₁₁₂∂y
                    ∂∂²𝝭∂x∂y∂x[i] += ∂𝝭∂x[i]*∂W₁₂₁∂x + ∂𝝭∂y[i]*∂W₁₂₂∂x
                    ∂∂²𝝭∂x∂y∂y[i] += ∂𝝭∂x[i]*∂W₁₂₁∂y + ∂𝝭∂y[i]*∂W₁₂₂∂y
                    ∂∂²𝝭∂y²∂x[i] += ∂𝝭∂x[i]*∂W₂₂₁∂x + ∂𝝭∂y[i]*∂W₂₂₂∂x
                    ∂∂²𝝭∂y²∂y[i] += ∂𝝭∂x[i]*∂W₂₂₁∂y + ∂𝝭∂y[i]*∂W₂₂₂∂y
                end
            end
        end

        for a in Γᴾ
            if ap∩a ≠ nothing
                ξ = a.𝓖[1]
                Δn₁s₁ = ξ.Δn₁s₁
                Δn₁s₂n₂s₁ = ξ.Δn₁s₂n₂s₁
                Δn₂s₂ = ξ.Δn₂s₂

                𝝭 = ξ[:𝝭]
                𝒒 = get𝒑₂(a,ξ)

                𝒒̂ᵀ𝗚⁻¹𝒒 =  𝒒̂ᵀ𝗚⁻¹*𝒒
                ∂𝒒̂ᵀ∂ξ𝗚⁻¹𝒒 =  ∂𝒒̂ᵀ∂ξ𝗚⁻¹*𝒒
                ∂𝒒̂ᵀ∂η𝗚⁻¹𝒒 =  ∂𝒒̂ᵀ∂η𝗚⁻¹*𝒒

                ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒 = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹𝒒*n₁₁+∂𝒒̂ᵀ∂η𝗚⁻¹𝒒*n₂₁)/2/𝐴
                ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒 = -(∂𝒒̂ᵀ∂ξ𝗚⁻¹𝒒*n₁₂+∂𝒒̂ᵀ∂η𝗚⁻¹𝒒*n₂₂)/2/𝐴

                Δms₁₁ =  𝒒̂ᵀ𝗚⁻¹𝒒*Δn₁s₁
                Δms₂₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*Δn₂s₂
                Δms₁₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*Δn₁s₂n₂s₁/2

                Δ∂ms₁₁∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*Δn₁s₁
                Δ∂ms₁₁∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*Δn₁s₁
                Δ∂ms₂₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*Δn₂s₂
                Δ∂ms₂₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*Δn₂s₂
                Δ∂ms₁₂∂x = ∂𝒒̂ᵀ∂x𝗚⁻¹𝒒*Δn₁s₂n₂s₁/2
                Δ∂ms₁₂∂y = ∂𝒒̂ᵀ∂y𝗚⁻¹𝒒*Δn₁s₂n₂s₁/2

                for i in 1:length(𝓒)
                    ∂²𝝭∂x²[i] += 𝝭[i]*Δms₁₁
                    ∂²𝝭∂x∂y[i] += 𝝭[i]*Δms₁₂
                    ∂²𝝭∂y²[i] += 𝝭[i]*Δms₂₂
                    ∂∂²𝝭∂x²∂x[i] += 𝝭[i]*Δ∂ms₁₁∂x
                    ∂∂²𝝭∂x²∂y[i] += 𝝭[i]*Δ∂ms₁₁∂y
                    ∂∂²𝝭∂x∂y∂x[i] += 𝝭[i]*Δ∂ms₁₂∂x
                    ∂∂²𝝭∂x∂y∂y[i] += 𝝭[i]*Δ∂ms₁₂∂y
                    ∂∂²𝝭∂y²∂x[i] += 𝝭[i]*Δ∂ms₂₂∂x
                    ∂∂²𝝭∂y²∂y[i] += 𝝭[i]*Δ∂ms₂₂∂y
                end
            end
        end
    end
end

function set∇̄²𝝭!(ap::ReproducingKernel{𝒑,𝑠,𝜙,:Tri3};Γᵍ::Vector{ReproducingKernel{𝒑,𝑠,𝜙,:Tri3}}=[],Γᶿ::Vector{ReproducingKernel{𝒑,𝑠,𝜙,:Tri3}}=[],Γᴾ::Vector{ReproducingKernel{𝒑,𝑠,𝜙,:Tri3}}=[]) where {𝒑,𝑠,𝜙}
    x₁ = ap.𝓒[1].x;y₁ = ap.𝓒[1].y
    x₂ = ap.𝓒[2].x;y₂ = ap.𝓒[2].y
    x₃ = ap.𝓒[3].x;y₃ = ap.𝓒[3].y
    𝐴 = get𝐴(ap)
    n₁₁ = y₃-y₂;n₂₁ = y₁-y₃;n₃₁ = y₂-y₁
    n₁₂ = x₂-x₃;n₂₂ = x₃-x₁;n₃₂ = x₁-x₂
    s₁₁ = -n₁₂;s₂₁ = -n₂₂;s₃₁ = -n₃₂
    s₁₂ =  n₁₁;s₂₂ =  n₂₁;s₃₂ =  n₃₁
    𝓒 = ap.𝓒
    𝓖 = ap.𝓖
    for ξ̂ in 𝓖
        𝒒̂ = get𝒑₂(ap,ξ̂)
        𝗚⁻¹ = cal𝗚₂!(ap)
        𝒒̂ᵀ𝗚⁻¹ = 𝒒̂*𝗚⁻¹

        ∂²𝝭∂x² = ξ̂[:∂²𝝭∂x²_]
        ∂²𝝭∂x∂y = ξ̂[:∂²𝝭∂x∂y_]
        ∂²𝝭∂y² = ξ̂[:∂²𝝭∂y²_]
        for i in 1:length(𝓒)
            ∂²𝝭∂x²[i] = 0.0
            ∂²𝝭∂x∂y[i] = 0.0
            ∂²𝝭∂y²[i] = 0.0
        end
        for a in Γᵍ
            if ap∩a ≠ nothing
                for ξ in a.𝓖
                    𝑤 = ξ.𝑤
                    n₁ = ξ.n₁
                    n₂ = ξ.n₂
                    s₁ = -n₂
                    s₂ = n₁
                    𝝭 = ξ[:𝝭]
                    𝒒, ∂𝒒∂ξ, ∂𝒒∂η = get∇²𝒑₂(a,ξ)

                    𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ = 𝒒̂ᵀ𝗚⁻¹*∂𝒒∂ξ
                    𝒒̂ᵀ𝗚⁻¹∂𝒒∂η = 𝒒̂ᵀ𝗚⁻¹*∂𝒒∂η

                    q₁ = 𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ*n₁₁ + 𝒒̂ᵀ𝗚⁻¹∂𝒒∂η*n₂₁
                    q₂ = 𝒒̂ᵀ𝗚⁻¹∂𝒒∂ξ*n₁₂ + 𝒒̂ᵀ𝗚⁻¹∂𝒒∂η*n₂₂

                    q₁n₁ = q₁*n₁
                    q₁n₂ = q₁*n₂
                    q₂n₁ = q₂*n₁
                    q₂n₂ = q₂*n₂
                    ms₁₁ = (q₁*s₁+q₂*s₂)*n₁*s₁
                    ms₁₂ = (q₁*s₁+q₂*s₂)*0.5*(n₁*s₂+n₂*s₁)
                    ms₂₂ = (q₁*s₁+q₂*s₂)*n₂*s₂

                    W₁₁ = (q₁n₁+ms₁₁)*𝑤/2/𝐴
                    W₁₂ = (q₁n₂+q₂n₁+2*ms₁₂)*𝑤/4/𝐴
                    W₂₂ = (q₂n₂+ms₂₂)*𝑤/2/𝐴
                    for i in 1:length(𝓒)
                        ∂²𝝭∂x²[i] += 𝝭[i]*W₁₁
                        ∂²𝝭∂x∂y[i] += 𝝭[i]*W₁₂
                        ∂²𝝭∂y²[i] += 𝝭[i]*W₂₂
                    end
                end
            end
        end

        for b in Γᶿ
            if ap∩b ≠ nothing
                for ξ in b.𝓖
                    𝑤 = ξ.𝑤
                    n₁ = ξ.n₁
                    n₂ = ξ.n₂
                    s₁ = -n₂
                    s₂ = n₁
                    ∂𝝭∂x = ξ[:∂𝝭∂x]
                    ∂𝝭∂y = ξ[:∂𝝭∂y]
                    𝒒 = get𝒑₂(b,ξ)

                    𝒒̂ᵀ𝗚⁻¹𝒒 =  𝒒̂ᵀ𝗚⁻¹*𝒒

                    mn₁₁n₁ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₁*n₁*n₁
                    mn₁₁n₂ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₁*n₁*n₂
                    mn₁₂n₁ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₁*n₂*n₁
                    mn₁₂n₂ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₁*n₂*n₂
                    mn₂₂n₁ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₂*n₂*n₁
                    mn₂₂n₂ = 𝒒̂ᵀ𝗚⁻¹𝒒*n₂*n₂*n₂

                    W₁₁₁ = mn₁₁n₁*𝑤
                    W₁₁₂ = mn₁₁n₂*𝑤
                    W₁₂₁ = mn₁₂n₁*𝑤
                    W₁₂₂ = mn₁₂n₂*𝑤
                    W₂₂₁ = mn₂₂n₁*𝑤
                    W₂₂₂ = mn₂₂n₂*𝑤

                    for i in 1:length(𝓒)
                        ∂²𝝭∂x²[i] += ∂𝝭∂x[i]*W₁₁₁ + ∂𝝭∂y[i]*W₁₁₂
                        ∂²𝝭∂x∂y[i] += ∂𝝭∂x[i]*W₁₂₁ + ∂𝝭∂y[i]*W₁₂₂
                        ∂²𝝭∂y²[i] += ∂𝝭∂x[i]*W₂₂₁ + ∂𝝭∂y[i]*W₂₂₂
                    end
                end
            end
        end

        for c in Γᴾ
            if ap∩c ≠ nothing
                ξ = c.𝓖[1]
                Δn₁s₁ = ξ.Δn₁s₁
                Δn₁s₂n₂s₁ = ξ.Δn₁s₂n₂s₁
                Δn₂s₂ = ξ.Δn₂s₂

                𝝭 = ξ[:𝝭]
                𝒒 = get𝒑₂(c,ξ)

                𝒒̂ᵀ𝗚⁻¹𝒒 =  𝒒̂ᵀ𝗚⁻¹*𝒒

                Δms₁₁ =  𝒒̂ᵀ𝗚⁻¹𝒒*Δn₁s₁
                Δms₂₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*Δn₂s₂
                Δms₁₂ =  𝒒̂ᵀ𝗚⁻¹𝒒*Δn₁s₂n₂s₁/2

                for i in 1:length(𝓒)
                    ∂²𝝭∂x²[i] += 𝝭[i]*Δms₁₁
                    ∂²𝝭∂x∂y[i] += 𝝭[i]*Δms₁₂
                    ∂²𝝭∂y²[i] += 𝝭[i]*Δms₂₂
                end
            end
        end
    end
end