
function set𝝭!(::Element{:Tet4},x::Node)
    ξ = x.ξ
    η = x.η
    ζ = x.ζ
    𝝭 = x[:𝝭]
   
    𝝭[1] = x.ξ
    𝝭[2] = x.η
    𝝭[3] = x.ζ
    𝝭[4] = 1.0-x.ξ-x.η-x.ζ
end
function set∇𝝭!(ap::Element{:Tet4},x::Node)
    𝑉 = ap.𝑉
    ξ = x.ξ
    η = x.η
    ζ = x.ζ
    𝝭 = x[:𝝭]
    𝝭[1] = 1.0-x.ξ-x.η-x.ζ
    𝝭[2] = x.ξ
    𝝭[3] = x.η
    𝝭[4] = x.ζ
    𝓒 = ap.𝓒
    v₁,v₂,v₃,v₄ = ap.𝓒
    x₁ = v₁.x
    y₁ = v₁.y
    z₁ = v₁.z
    x₂ = v₂.x
    y₂ = v₂.y
    z₂ = v₂.z
    x₃ = v₃.x
    y₃ = v₃.y
    z₃ = v₃.z
    x₄ = v₄.x
    y₄ = v₄.y
    z₄ = v₄.z
    ∂𝝭∂x = x[:∂𝝭∂x]
    ∂𝝭∂y = x[:∂𝝭∂y]
    ∂𝝭∂z = x[:∂𝝭∂z]
    ∂𝝭∂x[1] = ((-z₃+z₄)*y₂+( z₂-z₄)*y₃-(z₂-z₃)*y₄)/6.0/𝑉
    ∂𝝭∂x[2] = (( z₃-z₄)*y₁+( z₄-z₁)*y₃-(z₃-z₁)*y₄)/6.0/𝑉
    ∂𝝭∂x[3] = ((-z₂+z₄)*y₁+(-z₄+z₁)*y₂+(z₂-z₁)*y₄)/6.0/𝑉
    ∂𝝭∂x[4] = (( z₂-z₃)*y₁+( z₃-z₁)*y₂-(z₂-z₁)*y₃)/6.0/𝑉
    ∂𝝭∂y[1] = (( z₃-z₄)*x₂+(-z₂+z₄)*x₃+(z₂-z₃)*x₄)/6.0/𝑉
    ∂𝝭∂y[2] = ((-z₃+z₄)*x₁+(-z₄+z₁)*x₃+(z₃-z₁)*x₄)/6.0/𝑉
    ∂𝝭∂y[3] = (( z₂-z₄)*x₁+( z₄-z₁)*x₂-(z₂-z₁)*x₄)/6.0/𝑉
    ∂𝝭∂y[4] = (( z₂-z₃)*x₁+( z₃-z₁)*x₂-(z₂-z₁)*x₃)/6.0/𝑉
    ∂𝝭∂z[1] = ((-y₃+y₄)*x₂+( y₂-y₄)*x₃-(y₂-y₃)*x₄)/6.0/𝑉
    ∂𝝭∂z[2] = (( y₃-y₄)*x₁+( y₄-y₁)*x₃-(y₃-y₁)*x₄)/6.0/𝑉
    ∂𝝭∂z[3] = ((-y₂+y₄)*x₁+(-y₄+y₁)*x₂+(y₂-y₁)*x₄)/6.0/𝑉
    ∂𝝭∂z[4] = (( y₂-y₃)*x₁+( y₃-y₁)*x₂-(y₂-y₁)*x₃)/6.0/𝑉
end