
function set𝝭!(ap::Element{:TriHermite},x::Node)
    ξ₁ = 1-x.ξ-x.η
    ξ₂ = x.ξ
    ξ₃ = x.η
    𝝭 = x[:𝝭]
    𝝭[1] = 3*ξ₁^2-2*ξ₁^3-7*ξ₁*ξ₂*ξ₃
    𝝭[2] = 3*ξ₂^2-2*ξ₂^3-7*ξ₂*ξ₃*ξ₁
    𝝭[3] = 3*ξ₃^2-2*ξ₃^3-7*ξ₃*ξ₁*ξ₂
    𝝭[4] = ξ₁*ξ₂*(2*ξ₁+ξ₂-1)
    𝝭[5] = ξ₁*ξ₃*(2*ξ₁+ξ₃-1)
    𝝭[6] = ξ₂*ξ₃*(2*ξ₂+ξ₃-1)
    𝝭[7] = ξ₂*ξ₁*(2*ξ₂+ξ₁-1)
    𝝭[8] = ξ₃*ξ₁*(2*ξ₃+ξ₁-1)
    𝝭[9] = ξ₃*ξ₂*(2*ξ₃+ξ₂-1)
    𝝭[10] = 27*ξ₁*ξ₂*ξ₃
end

function set∇𝝭!(ap::Element{:Tri3},x::Node)
    𝐽 = ap.𝐽
    v₁ = ap.𝓒[1]
    v₂ = ap.𝓒[4]
    v₃ = ap.𝓒[7]
end