

function (op::Operator{:∫εᵢⱼNᵢⱼκᵢⱼMᵢⱼdΩ})(ap::T;k::AbstractMatrix{Float64}) where T<:AbstractElement
    𝓒 = ap.𝓒; 𝓖 = ap.𝓖
    E = op.E
    ν = op.ν
    h = op.h
    Dᵐ = E*h/(1-ν^2)
    Dᵇ = E*h^3/12/(1-ν^2)
    for ξ in 𝓖
        B₁ = ξ[:∂𝝭∂x]
        B₂ = ξ[:∂𝝭∂y]
        B₁₁ = ξ[:∂²𝝭∂x²]
        B₁₂ = ξ[:∂²𝝭∂x∂y]
        B₂₂ = ξ[:∂²𝝭∂y²]
        𝑤 = ξ.𝑤
        a¹¹ = ξ.a¹¹
        a¹² = ξ.a¹²
        a²² = ξ.a²²
        a₁₁ = ξ.a₁₁
        a₁₂ = ξ.a₁₂
        a₁₃ = ξ.a₁₃
        a₂₁ = ξ.a₂₁
        a₂₂ = ξ.a₂₂
        a₂₃ = ξ.a₂₃
        a₃₁ = ξ.a₃₁
        a₃₂ = ξ.a₃₂
        a₃₃ = ξ.a₃₃
        Γ¹₁₁ = ξ.Γ¹₁₁
        Γ¹₂₂ = ξ.Γ¹₂₂
        Γ¹₁₂ = ξ.Γ¹₁₂
        Γ²₁₁ = ξ.Γ²₁₁
        Γ²₂₂ = ξ.Γ²₂₂
        Γ²₁₂ = ξ.Γ²₁₂
        𝐃 = @SArray [                  a¹¹*a¹¹ ν*a¹¹*a²² + (1-ν)*a¹²*a¹²                            a¹¹*a¹²;
                     ν*a¹¹*a²² + (1-ν)*a¹²*a¹²                   a²²*a²²                            a²²*a¹²;
                                       a¹¹*a¹²                   a²²*a¹² 0.5*((1-ν)*a¹¹*a²² + (1+ν)*a¹²*a¹²)]
        for (i,xᵢ) in enumerate(𝓒)
            I = xᵢ.𝐼
            𝐁ᵐᵢ = @SArray [          a₁₁*B₁[i]           a₁₂*B₁[i]           a₁₃*B₁[i];
                                     a₂₁*B₂[i]           a₂₂*B₂[i]           a₂₃*B₂[i];
                           a₁₁*B₂[i]+a₂₁*B₁[i] a₁₂*B₂[i]+a₂₂*B₁[i] a₁₃*B₂[i]+a₂₃*B₁[i]]
            Bᵇ₁₁ = Γ¹₁₁*B₁[i]+Γ²₁₁*B₂[i]-B₁₁[i]
            Bᵇ₂₂ = Γ¹₂₂*B₁[i]+Γ²₂₂*B₂[i]-B₂₂[i]
            Bᵇ₁₂ = Γ¹₁₂*B₁[i]+Γ²₁₂*B₂[i]-B₁₂[i]
            𝐁ᵇᵢ = @SArray [  Bᵇ₁₁*a₃₁   Bᵇ₁₁*a₃₂   Bᵇ₁₁*a₃₃;
                             Bᵇ₂₂*a₃₁   Bᵇ₂₂*a₃₂   Bᵇ₂₂*a₃₃;
                           2*Bᵇ₁₂*a₃₁ 2*Bᵇ₁₂*a₃₂ 2*Bᵇ₁₂*a₃₃]
            for (j,xⱼ) in enumerate(𝓒)
                J = xⱼ.𝐼
                𝐁ᵐⱼ = @SArray [          a₁₁*B₁[j]           a₁₂*B₁[j]           a₁₃*B₁[j];
                                         a₂₁*B₂[j]           a₂₂*B₂[j]           a₂₃*B₂[j];
                               a₁₁*B₂[j]+a₂₁*B₁[j] a₁₂*B₂[j]+a₂₂*B₁[j] a₁₃*B₂[j]+a₂₃*B₁[j]]
                Bᵇ₁₁ = Γ¹₁₁*B₁[j]+Γ²₁₁*B₂[j]-B₁₁[j]
                Bᵇ₂₂ = Γ¹₂₂*B₁[j]+Γ²₂₂*B₂[j]-B₂₂[j]
                Bᵇ₁₂ = Γ¹₁₂*B₁[j]+Γ²₁₂*B₂[j]-B₁₂[j]
                𝐁ᵇⱼ = @SArray [  Bᵇ₁₁*a₃₁   Bᵇ₁₁*a₃₂   Bᵇ₁₁*a₃₃;
                                 Bᵇ₂₂*a₃₁   Bᵇ₂₂*a₃₂   Bᵇ₂₂*a₃₃;
                               2*Bᵇ₁₂*a₃₁ 2*Bᵇ₁₂*a₃₂ 2*Bᵇ₁₂*a₃₃]
                kᵐ = Dᵐ*𝐁ᵐᵢ'*𝐃*𝐁ᵐⱼ
                kᵇ = Dᵇ*𝐁ᵇᵢ'*𝐃*𝐁ᵇⱼ
                k[3*I-2,3*J-2] += (kᵐ[1,1] + kᵇ[1,1])*𝑤
                k[3*I-2,3*J-1] += (kᵐ[1,2] + kᵇ[1,2])*𝑤
                k[3*I-2,3*J]   += (kᵐ[1,3] + kᵇ[1,3])*𝑤
                k[3*I-1,3*J-2] += (kᵐ[2,1] + kᵇ[2,1])*𝑤
                k[3*I-1,3*J-1] += (kᵐ[2,2] + kᵇ[2,2])*𝑤
                k[3*I-1,3*J]   += (kᵐ[2,3] + kᵇ[2,3])*𝑤
                k[3*I,3*J-2]   += (kᵐ[3,1] + kᵇ[3,1])*𝑤
                k[3*I,3*J-1]   += (kᵐ[3,2] + kᵇ[3,2])*𝑤
                k[3*I,3*J]     += (kᵐ[3,3] + kᵇ[3,3])*𝑤
            end
        end
    end
end

function (op::Operator{:∫δθθdΓ})(ap::T;k::AbstractMatrix{Float64},f::AbstractVector{Float64}) where T<:AbstractElement
    𝓒 = ap.𝓒; 𝓖 = ap.𝓖
    α = op.α
    for ξ in 𝓖
        𝑤 = ξ.𝑤
        B₁ = ξ[:∂𝝭∂x]
        B₂ = ξ[:∂𝝭∂y]
        n¹ = ξ.n₁
        n² = ξ.n₂
        a₃₁ = ξ.a₃₁
        a₃₂ = ξ.a₃₂
        a₃₃ = ξ.a₃₃
        θ = ξ.θ
        for (i,xᵢ) in enumerate(𝓒)
            I = xᵢ.𝐼
            𝐁ₙᵢ = @SArray [(B₁[i]*n¹ + B₂[i]*n²)*a₃₁;(B₁[i]*n¹ + B₂[i]*n²)*a₃₂;(B₁[i]*n¹ + B₂[i]*n²)*a₃₃]
            for (j,xⱼ) in enumerate(𝓒)
                J = xⱼ.𝐼
                𝐁ₙⱼ = @SArray [(B₁[j]*n¹ + B₂[j]*n²)*a₃₁;(B₁[j]*n¹ + B₂[j]*n²)*a₃₂;(B₁[j]*n¹ + B₂[j]*n²)*a₃₃]
                k[3*I-2,3*J-2] += α*𝐁ₙᵢ[1]*𝐁ₙⱼ[1]*𝑤
                k[3*I-2,3*J-1] += α*𝐁ₙᵢ[1]*𝐁ₙⱼ[2]*𝑤
                k[3*I-2,3*J]   += α*𝐁ₙᵢ[1]*𝐁ₙⱼ[3]*𝑤
                k[3*I-1,3*J-2] += α*𝐁ₙᵢ[2]*𝐁ₙⱼ[1]*𝑤
                k[3*I-1,3*J-1] += α*𝐁ₙᵢ[2]*𝐁ₙⱼ[2]*𝑤
                k[3*I-1,3*J]   += α*𝐁ₙᵢ[2]*𝐁ₙⱼ[3]*𝑤
                k[3*I,3*J-2]   += α*𝐁ₙᵢ[3]*𝐁ₙⱼ[1]*𝑤
                k[3*I,3*J-1]   += α*𝐁ₙᵢ[3]*𝐁ₙⱼ[2]*𝑤
                k[3*I,3*J]     += α*𝐁ₙᵢ[3]*𝐁ₙⱼ[3]*𝑤
            end
            f[3*I-2] += α*𝐁ₙᵢ[1]*θ*𝑤
            f[3*I-1] += α*𝐁ₙᵢ[2]*θ*𝑤
            f[3*I]   += α*𝐁ₙᵢ[3]*θ*𝑤
        end
    end
end

function (op::Operator{:∫NC⁻¹NdΩ})(ap::T;k::AbstractMatrix{Float64}) where T<:AbstractElement
    𝓒 = ap.𝓒;𝓖 = ap.𝓖
    E = op.E
    ν = op.ν
    h = op.h
    Dᵐ = E*h^3/12/(1-ν^2)
    for ξ in 𝓖
        𝑤 = ξ.𝑤
        N = ξ[:𝝭]
        a¹¹ = ξ.a¹¹
        a¹² = ξ.a¹²
        a²² = ξ.a²²
        𝒂¹₍₁₎ = ξ.𝒂¹₍₁₎
        𝒂¹₍₂₎ = ξ.𝒂¹₍₂₎
        𝒂¹₍₃₎ = ξ.𝒂¹₍₃₎
        𝒂²₍₁₎ = ξ.𝒂²₍₁₎
        𝒂²₍₂₎ = ξ.𝒂²₍₂₎
        𝒂²₍₃₎ = ξ.𝒂²₍₃₎
        𝑫⁻¹ = inv(@SArray [                  a¹¹*a¹¹ ν*a¹¹*a²² + (1-ν)*a¹²*a¹²                            a¹¹*a¹²;
                           ν*a¹¹*a²² + (1-ν)*a¹²*a¹²                   a²²*a²²                            a²²*a¹²;
                                             a¹¹*a¹²                   a²²*a¹² 0.5*((1-ν)*a¹¹*a²² + (1+ν)*a¹²*a¹²)])
        C⁻¹₁₁₁₁ = 𝑫⁻¹[1,1]
        C⁻¹₂₂₂₂ = 𝑫⁻¹[2,2]
        C⁻¹₁₁₂₂ = 𝑫⁻¹[1,2]
        C⁻¹₂₂₁₁ = 𝑫⁻¹[1,2]
        C⁻¹₁₁₁₂ = 𝑫⁻¹[1,3]
        C⁻¹₁₁₂₁ = 𝑫⁻¹[1,3]
        C⁻¹₁₂₁₁ = 𝑫⁻¹[1,3]
        C⁻¹₂₁₁₁ = 𝑫⁻¹[1,3]
        C⁻¹₂₂₁₂ = 𝑫⁻¹[2,3]
        C⁻¹₂₂₂₁ = 𝑫⁻¹[2,3]
        C⁻¹₁₂₂₂ = 𝑫⁻¹[2,3]
        C⁻¹₂₁₂₂ = 𝑫⁻¹[2,3]
        C⁻¹₁₂₁₂ = 𝑫⁻¹[3,3]
        C⁻¹₂₁₁₂ = 𝑫⁻¹[3,3]
        C⁻¹₁₂₂₁ = 𝑫⁻¹[3,3]
        C⁻¹₂₁₂₁ = 𝑫⁻¹[3,3]

        C₁₁₁₁ = (𝒂¹₍₁₎*C⁻¹₁₁₁₁*𝒂¹₍₁₎ + 𝒂¹₍₁₎*C⁻¹₁₁₁₂*𝒂²₍₁₎ + 𝒂²₍₁₎*C⁻¹₂₁₁₁*𝒂¹₍₁₎ + 𝒂²₍₁₎*C⁻¹₂₁₁₂*𝒂²₍₁₎)/Dᵐ
        C₁₂₁₁ = (𝒂¹₍₁₎*C⁻¹₁₂₁₁*𝒂¹₍₁₎ + 𝒂¹₍₁₎*C⁻¹₁₂₁₂*𝒂²₍₁₎ + 𝒂²₍₁₎*C⁻¹₂₂₁₁*𝒂¹₍₁₎ + 𝒂²₍₁₎*C⁻¹₂₂₁₂*𝒂²₍₁₎)/Dᵐ
        C₂₁₁₁ = (𝒂¹₍₂₎*C⁻¹₁₁₁₁*𝒂¹₍₁₎ + 𝒂¹₍₂₎*C⁻¹₁₁₁₂*𝒂²₍₁₎ + 𝒂²₍₂₎*C⁻¹₂₁₁₁*𝒂¹₍₁₎ + 𝒂²₍₂₎*C⁻¹₂₁₁₂*𝒂²₍₁₎)/Dᵐ
        C₂₂₁₁ = (𝒂¹₍₂₎*C⁻¹₁₂₁₁*𝒂¹₍₁₎ + 𝒂¹₍₂₎*C⁻¹₁₂₁₂*𝒂²₍₁₎ + 𝒂²₍₂₎*C⁻¹₂₂₁₁*𝒂¹₍₁₎ + 𝒂²₍₂₎*C⁻¹₂₂₁₂*𝒂²₍₁₎)/Dᵐ
        C₃₁₁₁ = (𝒂¹₍₃₎*C⁻¹₁₁₁₁*𝒂¹₍₁₎ + 𝒂¹₍₃₎*C⁻¹₁₁₁₂*𝒂²₍₁₎ + 𝒂²₍₃₎*C⁻¹₂₁₁₁*𝒂¹₍₁₎ + 𝒂²₍₃₎*C⁻¹₂₁₁₂*𝒂²₍₁₎)/Dᵐ
        C₃₂₁₁ = (𝒂¹₍₃₎*C⁻¹₁₂₁₁*𝒂¹₍₁₎ + 𝒂¹₍₃₎*C⁻¹₁₂₁₂*𝒂²₍₁₎ + 𝒂²₍₃₎*C⁻¹₂₂₁₁*𝒂¹₍₁₎ + 𝒂²₍₃₎*C⁻¹₂₂₁₂*𝒂²₍₁₎)/Dᵐ

        C₁₁₂₁ = (𝒂¹₍₁₎*C⁻¹₁₁₂₁*𝒂¹₍₁₎ + 𝒂¹₍₁₎*C⁻¹₁₁₂₂*𝒂²₍₁₎ + 𝒂²₍₁₎*C⁻¹₂₁₂₁*𝒂¹₍₁₎ + 𝒂²₍₁₎*C⁻¹₂₁₂₂*𝒂²₍₁₎)/Dᵐ
        C₁₂₂₁ = (𝒂¹₍₁₎*C⁻¹₁₂₂₁*𝒂¹₍₁₎ + 𝒂¹₍₁₎*C⁻¹₁₂₂₂*𝒂²₍₁₎ + 𝒂²₍₁₎*C⁻¹₂₂₂₁*𝒂¹₍₁₎ + 𝒂²₍₁₎*C⁻¹₂₂₂₂*𝒂²₍₁₎)/Dᵐ
        C₂₁₂₁ = (𝒂¹₍₂₎*C⁻¹₁₁₂₁*𝒂¹₍₁₎ + 𝒂¹₍₂₎*C⁻¹₁₁₂₂*𝒂²₍₁₎ + 𝒂²₍₂₎*C⁻¹₂₁₂₁*𝒂¹₍₁₎ + 𝒂²₍₂₎*C⁻¹₂₁₂₂*𝒂²₍₁₎)/Dᵐ
        C₂₂₂₁ = (𝒂¹₍₂₎*C⁻¹₁₂₂₁*𝒂¹₍₁₎ + 𝒂¹₍₂₎*C⁻¹₁₂₂₂*𝒂²₍₁₎ + 𝒂²₍₂₎*C⁻¹₂₂₂₁*𝒂¹₍₁₎ + 𝒂²₍₂₎*C⁻¹₂₂₂₂*𝒂²₍₁₎)/Dᵐ
        C₃₁₂₁ = (𝒂¹₍₃₎*C⁻¹₁₁₂₁*𝒂¹₍₁₎ + 𝒂¹₍₃₎*C⁻¹₁₁₂₂*𝒂²₍₁₎ + 𝒂²₍₃₎*C⁻¹₂₁₂₁*𝒂¹₍₁₎ + 𝒂²₍₃₎*C⁻¹₂₁₂₂*𝒂²₍₁₎)/Dᵐ
        C₃₂₂₁ = (𝒂¹₍₃₎*C⁻¹₁₂₂₁*𝒂¹₍₁₎ + 𝒂¹₍₃₎*C⁻¹₁₂₂₂*𝒂²₍₁₎ + 𝒂²₍₃₎*C⁻¹₂₂₂₁*𝒂¹₍₁₎ + 𝒂²₍₃₎*C⁻¹₂₂₂₂*𝒂²₍₁₎)/Dᵐ

        C₁₁₁₂ = (𝒂¹₍₁₎*C⁻¹₁₁₁₁*𝒂¹₍₂₎ + 𝒂¹₍₁₎*C⁻¹₁₁₁₂*𝒂²₍₂₎ + 𝒂²₍₁₎*C⁻¹₂₁₁₁*𝒂¹₍₂₎ + 𝒂²₍₁₎*C⁻¹₂₁₁₂*𝒂²₍₂₎)/Dᵐ
        C₁₂₁₂ = (𝒂¹₍₁₎*C⁻¹₁₂₁₁*𝒂¹₍₂₎ + 𝒂¹₍₁₎*C⁻¹₁₂₁₂*𝒂²₍₂₎ + 𝒂²₍₁₎*C⁻¹₂₂₁₁*𝒂¹₍₂₎ + 𝒂²₍₁₎*C⁻¹₂₂₁₂*𝒂²₍₂₎)/Dᵐ
        C₂₁₁₂ = (𝒂¹₍₂₎*C⁻¹₁₁₁₁*𝒂¹₍₂₎ + 𝒂¹₍₂₎*C⁻¹₁₁₁₂*𝒂²₍₂₎ + 𝒂²₍₂₎*C⁻¹₂₁₁₁*𝒂¹₍₂₎ + 𝒂²₍₂₎*C⁻¹₂₁₁₂*𝒂²₍₂₎)/Dᵐ
        C₂₂₁₂ = (𝒂¹₍₂₎*C⁻¹₁₂₁₁*𝒂¹₍₂₎ + 𝒂¹₍₂₎*C⁻¹₁₂₁₂*𝒂²₍₂₎ + 𝒂²₍₂₎*C⁻¹₂₂₁₁*𝒂¹₍₂₎ + 𝒂²₍₂₎*C⁻¹₂₂₁₂*𝒂²₍₂₎)/Dᵐ
        C₃₁₁₂ = (𝒂¹₍₃₎*C⁻¹₁₁₁₁*𝒂¹₍₂₎ + 𝒂¹₍₃₎*C⁻¹₁₁₁₂*𝒂²₍₂₎ + 𝒂²₍₃₎*C⁻¹₂₁₁₁*𝒂¹₍₂₎ + 𝒂²₍₃₎*C⁻¹₂₁₁₂*𝒂²₍₂₎)/Dᵐ
        C₃₂₁₂ = (𝒂¹₍₃₎*C⁻¹₁₂₁₁*𝒂¹₍₂₎ + 𝒂¹₍₃₎*C⁻¹₁₂₁₂*𝒂²₍₂₎ + 𝒂²₍₃₎*C⁻¹₂₂₁₁*𝒂¹₍₂₎ + 𝒂²₍₃₎*C⁻¹₂₂₁₂*𝒂²₍₂₎)/Dᵐ

        C₁₁₂₂ = (𝒂¹₍₁₎*C⁻¹₁₁₂₁*𝒂¹₍₂₎ + 𝒂¹₍₁₎*C⁻¹₁₁₂₂*𝒂²₍₂₎ + 𝒂²₍₁₎*C⁻¹₂₁₂₁*𝒂¹₍₂₎ + 𝒂²₍₁₎*C⁻¹₂₁₂₂*𝒂²₍₂₎)/Dᵐ
        C₁₂₂₂ = (𝒂¹₍₁₎*C⁻¹₁₂₂₁*𝒂¹₍₂₎ + 𝒂¹₍₁₎*C⁻¹₁₂₂₂*𝒂²₍₂₎ + 𝒂²₍₁₎*C⁻¹₂₂₂₁*𝒂¹₍₂₎ + 𝒂²₍₁₎*C⁻¹₂₂₂₂*𝒂²₍₂₎)/Dᵐ
        C₂₁₂₂ = (𝒂¹₍₂₎*C⁻¹₁₁₂₁*𝒂¹₍₂₎ + 𝒂¹₍₂₎*C⁻¹₁₁₂₂*𝒂²₍₂₎ + 𝒂²₍₂₎*C⁻¹₂₁₂₁*𝒂¹₍₂₎ + 𝒂²₍₂₎*C⁻¹₂₁₂₂*𝒂²₍₂₎)/Dᵐ
        C₂₂₂₂ = (𝒂¹₍₂₎*C⁻¹₁₂₂₁*𝒂¹₍₂₎ + 𝒂¹₍₂₎*C⁻¹₁₂₂₂*𝒂²₍₂₎ + 𝒂²₍₂₎*C⁻¹₂₂₂₁*𝒂¹₍₂₎ + 𝒂²₍₂₎*C⁻¹₂₂₂₂*𝒂²₍₂₎)/Dᵐ
        C₃₁₂₂ = (𝒂¹₍₃₎*C⁻¹₁₁₂₁*𝒂¹₍₂₎ + 𝒂¹₍₃₎*C⁻¹₁₁₂₂*𝒂²₍₂₎ + 𝒂²₍₃₎*C⁻¹₂₁₂₁*𝒂¹₍₂₎ + 𝒂²₍₃₎*C⁻¹₂₁₂₂*𝒂²₍₂₎)/Dᵐ
        C₃₂₂₂ = (𝒂¹₍₃₎*C⁻¹₁₂₂₁*𝒂¹₍₂₎ + 𝒂¹₍₃₎*C⁻¹₁₂₂₂*𝒂²₍₂₎ + 𝒂²₍₃₎*C⁻¹₂₂₂₁*𝒂¹₍₂₎ + 𝒂²₍₃₎*C⁻¹₂₂₂₂*𝒂²₍₂₎)/Dᵐ

        C₁₁₁₃ = (𝒂¹₍₁₎*C⁻¹₁₁₁₁*𝒂¹₍₃₎ + 𝒂¹₍₁₎*C⁻¹₁₁₁₂*𝒂²₍₃₎ + 𝒂²₍₁₎*C⁻¹₂₁₁₁*𝒂¹₍₃₎ + 𝒂²₍₁₎*C⁻¹₂₁₁₂*𝒂²₍₃₎)/Dᵐ
        C₁₂₁₃ = (𝒂¹₍₁₎*C⁻¹₁₂₁₁*𝒂¹₍₃₎ + 𝒂¹₍₁₎*C⁻¹₁₂₁₂*𝒂²₍₃₎ + 𝒂²₍₁₎*C⁻¹₂₂₁₁*𝒂¹₍₃₎ + 𝒂²₍₁₎*C⁻¹₂₂₁₂*𝒂²₍₃₎)/Dᵐ
        C₂₁₁₃ = (𝒂¹₍₂₎*C⁻¹₁₁₁₁*𝒂¹₍₃₎ + 𝒂¹₍₂₎*C⁻¹₁₁₁₂*𝒂²₍₃₎ + 𝒂²₍₂₎*C⁻¹₂₁₁₁*𝒂¹₍₃₎ + 𝒂²₍₂₎*C⁻¹₂₁₁₂*𝒂²₍₃₎)/Dᵐ
        C₂₂₁₃ = (𝒂¹₍₂₎*C⁻¹₁₂₁₁*𝒂¹₍₃₎ + 𝒂¹₍₂₎*C⁻¹₁₂₁₂*𝒂²₍₃₎ + 𝒂²₍₂₎*C⁻¹₂₂₁₁*𝒂¹₍₃₎ + 𝒂²₍₂₎*C⁻¹₂₂₁₂*𝒂²₍₃₎)/Dᵐ
        C₃₁₁₃ = (𝒂¹₍₃₎*C⁻¹₁₁₁₁*𝒂¹₍₃₎ + 𝒂¹₍₃₎*C⁻¹₁₁₁₂*𝒂²₍₃₎ + 𝒂²₍₃₎*C⁻¹₂₁₁₁*𝒂¹₍₃₎ + 𝒂²₍₃₎*C⁻¹₂₁₁₂*𝒂²₍₃₎)/Dᵐ
        C₃₂₁₃ = (𝒂¹₍₃₎*C⁻¹₁₂₁₁*𝒂¹₍₃₎ + 𝒂¹₍₃₎*C⁻¹₁₂₁₂*𝒂²₍₃₎ + 𝒂²₍₃₎*C⁻¹₂₂₁₁*𝒂¹₍₃₎ + 𝒂²₍₃₎*C⁻¹₂₂₁₂*𝒂²₍₃₎)/Dᵐ

        C₁₁₂₃ = (𝒂¹₍₁₎*C⁻¹₁₁₂₁*𝒂¹₍₃₎ + 𝒂¹₍₁₎*C⁻¹₁₁₂₂*𝒂²₍₃₎ + 𝒂²₍₁₎*C⁻¹₂₁₂₁*𝒂¹₍₃₎ + 𝒂²₍₁₎*C⁻¹₂₁₂₂*𝒂²₍₃₎)/Dᵐ
        C₁₂₂₃ = (𝒂¹₍₁₎*C⁻¹₁₂₂₁*𝒂¹₍₃₎ + 𝒂¹₍₁₎*C⁻¹₁₂₂₂*𝒂²₍₃₎ + 𝒂²₍₁₎*C⁻¹₂₂₂₁*𝒂¹₍₃₎ + 𝒂²₍₁₎*C⁻¹₂₂₂₂*𝒂²₍₃₎)/Dᵐ
        C₂₁₂₃ = (𝒂¹₍₂₎*C⁻¹₁₁₂₁*𝒂¹₍₃₎ + 𝒂¹₍₂₎*C⁻¹₁₁₂₂*𝒂²₍₃₎ + 𝒂²₍₂₎*C⁻¹₂₁₂₁*𝒂¹₍₃₎ + 𝒂²₍₂₎*C⁻¹₂₁₂₂*𝒂²₍₃₎)/Dᵐ
        C₂₂₂₃ = (𝒂¹₍₂₎*C⁻¹₁₂₂₁*𝒂¹₍₃₎ + 𝒂¹₍₂₎*C⁻¹₁₂₂₂*𝒂²₍₃₎ + 𝒂²₍₂₎*C⁻¹₂₂₂₁*𝒂¹₍₃₎ + 𝒂²₍₂₎*C⁻¹₂₂₂₂*𝒂²₍₃₎)/Dᵐ
        C₃₁₂₃ = (𝒂¹₍₃₎*C⁻¹₁₁₂₁*𝒂¹₍₃₎ + 𝒂¹₍₃₎*C⁻¹₁₁₂₂*𝒂²₍₃₎ + 𝒂²₍₃₎*C⁻¹₂₁₂₁*𝒂¹₍₃₎ + 𝒂²₍₃₎*C⁻¹₂₁₂₂*𝒂²₍₃₎)/Dᵐ
        C₃₂₂₃ = (𝒂¹₍₃₎*C⁻¹₁₂₂₁*𝒂¹₍₃₎ + 𝒂¹₍₃₎*C⁻¹₁₂₂₂*𝒂²₍₃₎ + 𝒂²₍₃₎*C⁻¹₂₂₂₁*𝒂¹₍₃₎ + 𝒂²₍₃₎*C⁻¹₂₂₂₂*𝒂²₍₃₎)/Dᵐ

        for (i,xᵢ) in enumerate(𝓒)
            I = xᵢ.𝐼
            for (j,xⱼ) in enumerate(𝓒)
                J = xⱼ.𝐼
                k[6*I-5,6*J-5] += N[i]*C₁₁₁₁*N[j]*𝑤
                k[6*I-5,6*J-4] += N[i]*C₁₁₂₁*N[j]*𝑤
                k[6*I-5,6*J-3] += N[i]*C₁₁₁₂*N[j]*𝑤
                k[6*I-5,6*J-2] += N[i]*C₁₁₂₂*N[j]*𝑤
                k[6*I-5,6*J-1] += N[i]*C₁₁₁₃*N[j]*𝑤
                k[6*I-5,6*J]   += N[i]*C₁₁₂₃*N[j]*𝑤
                k[6*I-4,6*J-5] += N[i]*C₁₂₁₁*N[j]*𝑤
                k[6*I-4,6*J-4] += N[i]*C₁₂₂₁*N[j]*𝑤
                k[6*I-4,6*J-3] += N[i]*C₁₂₁₂*N[j]*𝑤
                k[6*I-4,6*J-2] += N[i]*C₁₂₂₂*N[j]*𝑤
                k[6*I-4,6*J-1] += N[i]*C₁₂₁₃*N[j]*𝑤
                k[6*I-4,6*J]   += N[i]*C₁₂₂₃*N[j]*𝑤
                k[6*I-3,6*J-5] += N[i]*C₂₁₁₁*N[j]*𝑤
                k[6*I-3,6*J-4] += N[i]*C₂₁₂₁*N[j]*𝑤
                k[6*I-3,6*J-3] += N[i]*C₂₁₁₂*N[j]*𝑤
                k[6*I-3,6*J-2] += N[i]*C₂₁₂₂*N[j]*𝑤
                k[6*I-3,6*J-1] += N[i]*C₂₁₁₃*N[j]*𝑤
                k[6*I-3,6*J]   += N[i]*C₂₁₂₃*N[j]*𝑤
                k[6*I-2,6*J-5] += N[i]*C₂₂₁₁*N[j]*𝑤
                k[6*I-2,6*J-4] += N[i]*C₂₂₂₁*N[j]*𝑤
                k[6*I-2,6*J-3] += N[i]*C₂₂₁₂*N[j]*𝑤
                k[6*I-2,6*J-2] += N[i]*C₂₂₂₂*N[j]*𝑤
                k[6*I-2,6*J-1] += N[i]*C₂₂₁₃*N[j]*𝑤
                k[6*I-2,6*J]   += N[i]*C₂₂₂₃*N[j]*𝑤
                k[6*I-1,6*J-5] += N[i]*C₃₁₁₁*N[j]*𝑤
                k[6*I-1,6*J-4] += N[i]*C₃₁₂₁*N[j]*𝑤
                k[6*I-1,6*J-3] += N[i]*C₃₁₁₂*N[j]*𝑤
                k[6*I-1,6*J-2] += N[i]*C₃₁₂₂*N[j]*𝑤
                k[6*I-1,6*J-1] += N[i]*C₃₁₁₃*N[j]*𝑤
                k[6*I-1,6*J]   += N[i]*C₃₁₂₃*N[j]*𝑤
                k[6*I,6*J-5]   += N[i]*C₃₂₁₁*N[j]*𝑤
                k[6*I,6*J-4]   += N[i]*C₃₂₂₁*N[j]*𝑤
                k[6*I,6*J-3]   += N[i]*C₃₂₁₂*N[j]*𝑤
                k[6*I,6*J-2]   += N[i]*C₃₂₂₂*N[j]*𝑤
                k[6*I,6*J-1]   += N[i]*C₃₂₁₃*N[j]*𝑤
                k[6*I,6*J]     += N[i]*C₃₂₂₃*N[j]*𝑤
            end
        end
    end
end

function (op::Operator{:∫MC⁻¹MdΩ})(ap::T;k::AbstractMatrix{Float64}) where T<:AbstractElement
    𝓒 = ap.𝓒;𝓖 = ap.𝓖
    E = op.E
    ν = op.ν
    h = op.h
    Dᵇ = E*h/(1-ν^2)
    for ξ in 𝓖
        𝑤 = ξ.𝑤
        N = ξ[:𝝭]
        a¹¹ = ξ.a¹¹
        a¹² = ξ.a¹²
        a²² = ξ.a²²
        𝑫⁻¹ = inv(@SArray [                  a¹¹*a¹¹ ν*a¹¹*a²² + (1-ν)*a¹²*a¹²                            a¹¹*a¹²;
                           ν*a¹¹*a²² + (1-ν)*a¹²*a¹²                   a²²*a²²                            a²²*a¹²;
                                             a¹¹*a¹²                   a²²*a¹² 0.5*((1-ν)*a¹¹*a²² + (1+ν)*a¹²*a¹²)])
        C₁₁₁₁ = 𝑫⁻¹[1,1]/Dᵇ
        C₂₂₂₂ = 𝑫⁻¹[2,2]/Dᵇ
        C₁₁₂₂ = 𝑫⁻¹[1,2]/Dᵇ
        C₁₁₁₂ = 𝑫⁻¹[1,3]/Dᵇ
        C₂₂₁₂ = 𝑫⁻¹[2,3]/Dᵇ
        C₁₂₁₂ = 𝑫⁻¹[3,3]/Dᵇ

        for (i,xᵢ) in enumerate(𝓒)
            I = xᵢ.𝐼
            for (j,xⱼ) in enumerate(𝓒)
                J = xⱼ.𝐼
                k[9*I-8,9*J-8] += N[i]*C₁₁₁₁*N[j]*𝑤
                k[9*I-8,9*J-7] += N[i]*C₁₁₂₂*N[j]*𝑤
                k[9*I-8,9*J-6] += N[i]*C₁₁₁₂*N[j]*𝑤
                k[9*I-7,9*J-8] += N[i]*C₁₁₂₂*N[j]*𝑤
                k[9*I-7,9*J-7] += N[i]*C₂₂₂₂*N[j]*𝑤
                k[9*I-7,9*J-6] += N[i]*C₂₂₁₂*N[j]*𝑤
                k[9*I-6,9*J-8] += N[i]*C₁₁₁₂*N[j]*𝑤
                k[9*I-6,9*J-7] += N[i]*C₂₂₁₂*N[j]*𝑤
                k[9*I-6,9*J-6] += N[i]*C₁₂₁₂*N[j]*𝑤

                k[9*I-5,9*J-5] += N[i]*C₁₁₁₁*N[j]*𝑤
                k[9*I-5,9*J-4] += N[i]*C₁₁₂₂*N[j]*𝑤
                k[9*I-5,9*J-3] += N[i]*C₁₁₁₂*N[j]*𝑤
                k[9*I-4,9*J-5] += N[i]*C₁₁₂₂*N[j]*𝑤
                k[9*I-4,9*J-4] += N[i]*C₂₂₂₂*N[j]*𝑤
                k[9*I-4,9*J-3] += N[i]*C₂₂₁₂*N[j]*𝑤
                k[9*I-3,9*J-5] += N[i]*C₁₁₁₂*N[j]*𝑤
                k[9*I-3,9*J-4] += N[i]*C₂₂₁₂*N[j]*𝑤
                k[9*I-3,9*J-3] += N[i]*C₁₂₁₂*N[j]*𝑤

                k[9*I-2,9*J-2] += N[i]*C₁₁₁₁*N[j]*𝑤
                k[9*I-2,9*J-1] += N[i]*C₁₁₂₂*N[j]*𝑤
                k[9*I-2,9*J]   += N[i]*C₁₁₁₂*N[j]*𝑤
                k[9*I-1,9*J-2] += N[i]*C₁₁₂₂*N[j]*𝑤
                k[9*I-1,9*J-1] += N[i]*C₂₂₂₂*N[j]*𝑤
                k[9*I-1,9*J]   += N[i]*C₂₂₁₂*N[j]*𝑤
                k[9*I,9*J-2]   += N[i]*C₁₁₁₂*N[j]*𝑤
                k[9*I,9*J-1]   += N[i]*C₂₂₁₂*N[j]*𝑤
                k[9*I,9*J]     += N[i]*C₁₂₁₂*N[j]*𝑤
            end
        end
    end
end

function (op::Operator{:∫𝒏𝑵𝒗dΓ})(a::T,b::S;k::AbstractMatrix{Float64},f::AbstractVector{Float64}) where {T<:AbstractElement,S<:AbstractElement}
    𝓒ᵃ = a.𝓒;𝓖ᵃ = a.𝓖
    𝓒ᵇ = b.𝓒;𝓖ᵇ = b.𝓖
    for (ξᵃ,ξᵇ) in zip(𝓖ᵃ,𝓖ᵇ)
        𝑤 = ξᵃ.𝑤
        N = ξᵃ[:𝝭]
        N̄ = ξᵇ[:𝝭]
        n₁ = ξᵃ.n₁
        n₂ = ξᵃ.n₂

        n₁₁ = ξᵇ.n₁₁
        n₁₂ = ξᵇ.n₁₂
        n₁₃ = ξᵇ.n₁₃
        n₂₂ = ξᵇ.n₂₂
        n₂₃ = ξᵇ.n₂₃
        n₃₃ = ξᵇ.n₃₃
        g₁ = ξᵇ.g₁
        g₂ = ξᵇ.g₂
        g₃ = ξᵇ.g₃
        for (i,xᵢ) in enumerate(𝓒ᵃ)
            I = xᵢ.𝐼
            for (j,xⱼ) in enumerate(𝓒ᵇ)
                J = xⱼ.𝐼
                k[6*I-5,3*J-2] -= n₁*N[i]*n₁₁*N̄[j]*𝑤
                k[6*I-4,3*J-2] -= n₂*N[i]*n₁₁*N̄[j]*𝑤
                k[6*I-3,3*J-2] -= n₁*N[i]*n₁₂*N̄[j]*𝑤
                k[6*I-2,3*J-2] -= n₂*N[i]*n₁₂*N̄[j]*𝑤
                k[6*I-1,3*J-2] -= n₁*N[i]*n₁₃*N̄[j]*𝑤
                k[6*I,3*J-2]   -= n₂*N[i]*n₁₃*N̄[j]*𝑤
                k[6*I-5,3*J-1] -= n₁*N[i]*n₁₂*N̄[j]*𝑤
                k[6*I-4,3*J-1] -= n₂*N[i]*n₁₂*N̄[j]*𝑤
                k[6*I-3,3*J-1] -= n₁*N[i]*n₂₂*N̄[j]*𝑤
                k[6*I-2,3*J-1] -= n₂*N[i]*n₂₂*N̄[j]*𝑤
                k[6*I-1,3*J-1] -= n₁*N[i]*n₂₃*N̄[j]*𝑤
                k[6*I,3*J-1]   -= n₂*N[i]*n₂₃*N̄[j]*𝑤
                k[6*I-5,3*J]   -= n₁*N[i]*n₁₃*N̄[j]*𝑤
                k[6*I-4,3*J]   -= n₂*N[i]*n₁₃*N̄[j]*𝑤
                k[6*I-3,3*J]   -= n₁*N[i]*n₂₃*N̄[j]*𝑤
                k[6*I-2,3*J]   -= n₂*N[i]*n₂₃*N̄[j]*𝑤
                k[6*I-1,3*J]   -= n₁*N[i]*n₃₃*N̄[j]*𝑤
                k[6*I,3*J]     -= n₂*N[i]*n₃₃*N̄[j]*𝑤
            end
            f[6*I-5] -= n₁*N[i]*(n₁₁*g₁+n₁₂*g₂+n₁₃*g₃)*𝑤
            f[6*I-4] -= n₂*N[i]*(n₁₁*g₁+n₁₂*g₂+n₁₃*g₃)*𝑤
            f[6*I-3] -= n₁*N[i]*(n₁₂*g₁+n₂₂*g₂+n₂₃*g₃)*𝑤
            f[6*I-2] -= n₂*N[i]*(n₁₂*g₁+n₂₂*g₂+n₂₃*g₃)*𝑤
            f[6*I-1] -= n₁*N[i]*(n₁₃*g₁+n₂₃*g₂+n₃₃*g₃)*𝑤
            f[6*I]   -= n₂*N[i]*(n₁₃*g₁+n₂₃*g₂+n₃₃*g₃)*𝑤
        end
    end
end

function (op::Operator{:∫∇𝑵𝒗dΩ})(a::T,b::S;k::AbstractMatrix{Float64}) where {T<:AbstractElement,S<:AbstractElement}
    𝓒ᵃ = a.𝓒;𝓖ᵃ = a.𝓖
    𝓒ᵇ = b.𝓒;𝓖ᵇ = b.𝓖
    for (ξᵃ,ξᵇ) in zip(𝓖ᵃ,𝓖ᵇ)
        𝑤 = ξᵃ.𝑤
        N = ξᵃ[:𝝭]
        B₁ = ξᵃ[:∂𝝭∂x]
        B₂ = ξᵃ[:∂𝝭∂y]
        N̄ = ξᵇ[:𝝭]
        Γᵞᵧ₁ = ξᵃ.Γ¹₁₁ + ξᵃ.Γ²₁₂
        Γᵞᵧ₂ = ξᵃ.Γ¹₁₂ + ξᵃ.Γ²₂₂

        for (i,xᵢ) in enumerate(𝓒ᵃ)
            I = xᵢ.𝐼
            B̃₁ = B₁[i] + Γᵞᵧ₁*N[i]
            B̃₂ = B₂[i] + Γᵞᵧ₂*N[i]
            for (j,xⱼ) in enumerate(𝓒ᵇ)
                J = xⱼ.𝐼
                k[6*I-5,3*J-2] += B̃₁*N̄[j]*𝑤
                k[6*I-4,3*J-2] += B̃₂*N̄[j]*𝑤
                k[6*I-3,3*J-1] += B̃₁*N̄[j]*𝑤
                k[6*I-2,3*J-1] += B̃₂*N̄[j]*𝑤
                k[6*I-1,3*J]   += B̃₁*N̄[j]*𝑤
                k[6*I,3*J]     += B̃₂*N̄[j]*𝑤
            end
        end
    end
end

function (op::Operator{:∫∇𝑴𝒏𝒂₃𝒗dΓ})(a::T,b::S;k::AbstractMatrix{Float64},f::AbstractVector{Float64}) where {T<:AbstractElement,S<:AbstractElement}
    𝓒ᵃ = a.𝓒;𝓖ᵃ = a.𝓖
    𝓒ᵇ = b.𝓒;𝓖ᵇ = b.𝓖
    for (ξᵃ,ξᵇ) in zip(𝓖ᵃ,𝓖ᵇ)
        𝑤 = ξᵃ.𝑤
        N = ξᵃ[:𝝭]
        B₁ = ξᵃ[:∂𝝭∂x]
        B₂ = ξᵃ[:∂𝝭∂y]
        N̄ = ξᵇ[:𝝭]
        n₁ = ξᵃ.n₁
        n₂ = ξᵃ.n₂
        s₁ = ξᵃ.s₁
        s₂ = ξᵃ.s₂
        a¹¹ = ξᵃ.a¹¹
        a²² = ξᵃ.a²²
        a¹² = ξᵃ.a¹²
        Γ¹₁₁ = ξᵃ.Γ¹₁₁
        Γ¹₁₂ = ξᵃ.Γ¹₁₂
        Γ¹₂₂ = ξᵃ.Γ¹₂₂
        Γ²₁₁ = ξᵃ.Γ²₁₁
        Γ²₁₂ = ξᵃ.Γ²₁₂
        Γ²₂₂ = ξᵃ.Γ²₂₂
        Γᵞ₁₁nᵧ = Γ¹₁₁*n₁ + Γ²₁₁*n₂ 
        Γᵞ₂₂nᵧ = Γ¹₂₂*n₁ + Γ²₂₂*n₂ 
        Γᵞ₁₂nᵧ = Γ¹₁₂*n₁ + Γ²₁₂*n₂
        Γᵞᵧ₁n₁ = Γ¹₁₁*n₁ + Γ²₁₂*n₁
        Γᵞᵧ₂n₂ = Γ¹₁₂*n₂ + Γ²₂₂*n₂
        Γᵞᵧ₂n₁ = Γ¹₁₂*n₁ + Γ²₂₂*n₁
        Γᵞᵧ₁n₂ = Γ¹₁₁*n₂ + Γ²₁₂*n₂
        s¹ = a¹¹*s₁ + a¹²*s₂
        s² = a¹²*s₁ + a²²*s₂
        s₁n₁s¹ = s₁*n₁*s¹
        s₁n₁s² = s₁*n₁*s²
        s₂n₂s¹ = s₂*n₂*s¹
        s₂n₂s² = s₂*n₂*s²
        s₁n₂s¹ = s₁*n₂*s¹
        s₁n₂s² = s₁*n₂*s²
        s₂n₁s¹ = s₂*n₁*s¹
        s₂n₁s² = s₂*n₁*s²

        Γᵝᵧ₁sᵦn₁sᵞ = Γ¹₁₁*s₁n₁s¹ + Γ¹₁₂*s₁n₁s² + Γ²₁₁*s₂n₁s¹ + Γ²₁₂*s₂n₁s²
        Γᵝᵧ₂sᵦn₂sᵞ = Γ¹₁₂*s₁n₂s¹ + Γ¹₂₂*s₁n₂s² + Γ²₁₂*s₂n₂s¹ + Γ²₂₂*s₂n₂s²
        Γᵝᵧ₁sᵦn₂sᵞ = Γ¹₁₁*s₁n₂s¹ + Γ¹₁₂*s₁n₂s² + Γ²₁₁*s₂n₂s¹ + Γ²₁₂*s₂n₂s²
        Γᵝᵧ₂sᵦn₁sᵞ = Γ¹₁₂*s₁n₁s¹ + Γ¹₂₂*s₁n₁s² + Γ²₁₂*s₂n₁s¹ + Γ²₂₂*s₂n₁s²

        Γᵝᵧ₁s₁nᵦsᵞ = Γ¹₁₁*s₁n₁s¹ + Γ¹₁₂*s₁n₁s² + Γ²₁₁*s₁n₂s¹ + Γ²₁₂*s₁n₂s²
        Γᵝᵧ₂s₂nᵦsᵞ = Γ¹₁₂*s₂n₁s¹ + Γ¹₂₂*s₂n₁s² + Γ²₁₂*s₂n₂s¹ + Γ²₂₂*s₂n₂s²
        Γᵝᵧ₁s₂nᵦsᵞ = Γ¹₁₁*s₂n₁s¹ + Γ¹₁₂*s₂n₁s² + Γ²₁₁*s₂n₂s¹ + Γ²₁₂*s₂n₂s²
        Γᵝᵧ₂s₁nᵦsᵞ = Γ¹₁₂*s₁n₁s¹ + Γ¹₂₂*s₁n₁s² + Γ²₁₂*s₁n₂s¹ + Γ²₂₂*s₁n₂s²

        n₁₁ = ξᵇ.n₁₁
        n₁₂ = ξᵇ.n₁₂
        n₁₃ = ξᵇ.n₁₃
        n₂₂ = ξᵇ.n₂₂
        n₂₃ = ξᵇ.n₂₃
        n₃₃ = ξᵇ.n₃₃

        g₁ = ξᵇ.g₁
        g₂ = ξᵇ.g₂
        g₃ = ξᵇ.g₃
        for (i,xᵢ) in enumerate(𝓒ᵃ)
            I = xᵢ.𝐼
            B̃₁₁ = B₁[i]*n₁ + N[i]*Γᵞ₁₁nᵧ + N[i]*Γᵞᵧ₁n₁ + B₁[i]s₁n₁s¹ + B₂[i]s₁n₁s² + N[i]*Γᵝᵧ₁sᵦn₁sᵞ + N[i]*Γᵝᵧ₁s₁nᵦsᵞ
            B̃₂₂ = B₂[i]*n₂ + N[i]*Γᵞ₂₂nᵧ + N[i]*Γᵞᵧ₂n₂ + B₁[i]s₂n₂s¹ + B₂[i]s₂n₂s² + N[i]*Γᵝᵧ₂sᵦn₂sᵞ + N[i]*Γᵝᵧ₂s₂nᵦsᵞ
            B̃₁₂ = B₁[i]*n₂ + B₂[i]*n₁ + 2*N[i]*Γᵞ₁₂nᵧ 
                + N[i]*(Γᵞᵧ₁n₂+Γᵞᵧ₂n₁) + B₁[i]*(s₁n₂s¹+s₂n₁s¹) + B₂[i]*(s₁n₂s²+s₂n₁s²) 
                + N[i]*(Γᵝᵧ₁sᵦn₂sᵞ+Γᵝᵧ₂sᵦn₁sᵞ) + N[i]*(Γᵝᵧ₁s₂nᵦsᵞ+Γᵝᵧ₂s₁nᵦsᵞ)
            for (j,xⱼ) in enumerate(𝓒ᵇ)
                J = xⱼ.𝐼
                k[9*I-8,3*J-2] -= B̃₁₁*n₁₁*N̄[j]*𝑤
                k[9*I-7,3*J-2] -= B̃₂₂*n₁₁*N̄[j]*𝑤
                k[9*I-6,3*J-2] -= B̃₁₂*n₁₁*N̄[j]*𝑤
                k[9*I-5,3*J-2] -= B̃₁₁*n₁₂*N̄[j]*𝑤
                k[9*I-4,3*J-2] -= B̃₁₁*n₁₂*N̄[j]*𝑤
                k[9*I-3,3*J-2] -= B̃₂₂*n₁₂*N̄[j]*𝑤
                k[9*I-2,3*J-2] -= B̃₁₂*n₁₃*N̄[j]*𝑤
                k[9*I-1,3*J-2] -= B̃₂₂*n₁₃*N̄[j]*𝑤
                k[9*I,3*J-2]   -= B̃₁₂*n₁₃*N̄[j]*𝑤
                k[9*I-8,3*J-1] -= B̃₁₁*n₁₂*N̄[j]*𝑤
                k[9*I-7,3*J-1] -= B̃₂₂*n₁₂*N̄[j]*𝑤
                k[9*I-6,3*J-1] -= B̃₁₂*n₁₂*N̄[j]*𝑤
                k[9*I-5,3*J-1] -= B̃₁₁*n₂₂*N̄[j]*𝑤
                k[9*I-4,3*J-1] -= B̃₂₂*n₂₂*N̄[j]*𝑤
                k[9*I-3,3*J-1] -= B̃₁₂*n₂₂*N̄[j]*𝑤
                k[9*I-2,3*J-1] -= B̃₁₁*n₂₃*N̄[j]*𝑤
                k[9*I-1,3*J-1] -= B̃₂₂*n₂₃*N̄[j]*𝑤
                k[9*I,3*J-1]   -= B̃₁₂*n₂₃*N̄[j]*𝑤
                k[9*I-8,3*J]   -= B̃₁₁*n₁₃*N̄[j]*𝑤
                k[9*I-7,3*J]   -= B̃₂₂*n₁₃*N̄[j]*𝑤
                k[9*I-6,3*J]   -= B̃₁₂*n₁₃*N̄[j]*𝑤
                k[9*I-5,3*J]   -= B̃₁₁*n₂₃*N̄[j]*𝑤
                k[9*I-4,3*J]   -= B̃₂₂*n₂₃*N̄[j]*𝑤
                k[9*I-3,3*J]   -= B̃₁₂*n₂₃*N̄[j]*𝑤
                k[9*I-2,3*J]   -= B̃₁₁*n₃₃*N̄[j]*𝑤
                k[9*I-1,3*J]   -= B̃₂₂*n₃₃*N̄[j]*𝑤
                k[9*I,3*J]     -= B̃₁₂*n₃₃*N̄[j]*𝑤
            end
            f[9*I-8] -= B̃₁₁*(n₁₁*g₁+n₁₂*g₂+n₁₃*g₃)*𝑤
            f[9*I-7] -= B̃₂₂*(n₁₁*g₁+n₁₂*g₂+n₁₃*g₃)*𝑤
            f[9*I-6] -= B̃₁₂*(n₁₁*g₁+n₁₂*g₂+n₁₃*g₃)*𝑤
            f[9*I-5] -= B̃₁₁*(n₁₂*g₁+n₂₂*g₂+n₂₃*g₃)*𝑤
            f[9*I-4] -= B̃₂₂*(n₁₂*g₁+n₂₂*g₂+n₂₃*g₃)*𝑤
            f[9*I-3] -= B̃₁₂*(n₁₂*g₁+n₂₂*g₂+n₂₃*g₃)*𝑤
            f[9*I-2] -= B̃₁₁*(n₁₃*g₁+n₂₃*g₂+n₃₃*g₃)*𝑤
            f[9*I-1] -= B̃₂₂*(n₁₃*g₁+n₂₃*g₂+n₃₃*g₃)*𝑤
            f[9*I]   -= B̃₁₂*(n₁₃*g₁+n₂₃*g₂+n₃₃*g₃)*𝑤
        end
    end
end

function (op::Operator{:∫MₙₙθₙdΓ})(a::T,b::S;k::AbstractMatrix{Float64},f::AbstractVector{Float64}) where {T<:AbstractElement,S<:AbstractElement}
    𝓒ᵃ = a.𝓒;𝓖ᵃ = a.𝓖
    𝓒ᵇ = b.𝓒;𝓖ᵇ = b.𝓖
    for (ξᵃ,ξᵇ) in zip(𝓖ᵃ,𝓖ᵇ)
        𝑤 = ξᵃ.𝑤
        N = ξᵃ[:𝝭]
        N̄ = ξᵇ[:𝝭]
        B̄₁ = ξᵇ[:∂𝝭∂x]
        B̄₂ = ξᵇ[:∂𝝭∂y]
        n₁ = ξᵃ.n₁
        n₂ = ξᵃ.n₂
        a¹¹ = ξᵃ.a¹¹
        a²² = ξᵃ.a²²
        a¹² = ξᵃ.a¹²
        n¹ = a¹¹*n₁ + a¹²*n₂
        n² = a¹²*n₁ + a²²*n₂
        n₁₁ = ξᵇ.n₁₁
        n₁₂ = ξᵇ.n₁₂
        n₁₃ = ξᵇ.n₁₃
        n₂₂ = ξᵇ.n₂₂
        n₂₃ = ξᵇ.n₂₃
        n₃₃ = ξᵇ.n₃₃
        θ = ξᵇ.θ
        for (i,xᵢ) in enumerate(𝓒ᵃ)
            I = xᵢ.𝐼
            N₁₁ = N[i]*n₁*n₁
            N₂₂ = N[i]*n₂*n₂
            N₁₂ = 2*N[i]*n₁*n₂
            for (j,xⱼ) in enumerate(𝓒ᵇ)
                J = xⱼ.𝐼
                B̄ₙ = n¹*B̄₁[j] + n²*B̄₂[j]
                k[9*I-8,3*J-2] += N₁₁*B̄ₙ*𝑤
                k[9*I-7,3*J-2] += N₂₂*B̄ₙ*𝑤
                k[9*I-6,3*J-2] += N₁₂*B̄ₙ*𝑤
                k[9*I-5,3*J-1] += N₁₁*B̄ₙ*𝑤
                k[9*I-4,3*J-1] += N₂₂*B̄ₙ*𝑤
                k[9*I-3,3*J-1] += N₁₂*B̄ₙ*𝑤
                k[9*I-2,3*J]   += N₁₁*B̄ₙ*𝑤
                k[9*I-1,3*J]   += N₂₂*B̄ₙ*𝑤
                k[9*I,3*J]     += N₁₂*B̄ₙ*𝑤
            end
            f[9*I-8] += N₁₁*θ*𝑤
            f[9*I-7] += N₂₂*θ*𝑤
            f[9*I-6] += N₁₂*θ*𝑤
            f[9*I-5] += N₁₁*θ*𝑤
            f[9*I-4] += N₂₂*θ*𝑤
            f[9*I-3] += N₁₂*θ*𝑤
            f[9*I-2] += N₁₁*θ*𝑤
            f[9*I-1] += N₂₂*θ*𝑤
            f[9*I]   += N₁₂*θ*𝑤
        end
    end
end

function (op::Operator{:ΔMₙₛ𝒂₃𝒗})(a::T,b::S;k::AbstractMatrix{Float64},f::AbstractVector{Float64}) where {T<:AbstractElement,S<:AbstractElement}
    𝓒ᵃ = a.𝓒;𝓖ᵃ = a.𝓖
    𝓒ᵇ = b.𝓒;𝓖ᵇ = b.𝓖
    for (ξᵃ,ξᵇ) in zip(𝓖ᵃ,𝓖ᵇ)
        𝑤 = ξᵃ.𝑤
        N = ξᵃ[:𝝭]
        N̄ = ξᵇ[:𝝭]
        n₁ = ξᵃ.n₁
        n₂ = ξᵃ.n₂
        s₁ = ξᵃ.s₁
        s₂ = ξᵃ.s₂
        Δ = ξᵃ.Δ

        n₁₁ = ξᵇ.n₁₁
        n₁₂ = ξᵇ.n₁₂
        n₁₃ = ξᵇ.n₁₃
        n₂₂ = ξᵇ.n₂₂
        n₂₃ = ξᵇ.n₂₃
        n₃₃ = ξᵇ.n₃₃

        g₁ = ξᵇ.g₁
        g₂ = ξᵇ.g₂
        g₃ = ξᵇ.g₃
        for (i,xᵢ) in enumerate(𝓒ᵃ)
            I = xᵢ.𝐼
            for (j,xⱼ) in enumerate(𝓒ᵇ)
                J = xⱼ.𝐼
                k[9*I-8,3*J-2] += Δ*N[i]*n₁₁*N̄[j]*s₁*n₁
                k[9*I-7,3*J-2] += Δ*N[i]*n₁₁*N̄[j]*s₂*n₂
                k[9*I-6,3*J-2] += Δ*N[i]*n₁₁*N̄[j]*(s₁*n₂+s₂*n₁)
                k[9*I-5,3*J-2] += Δ*N[i]*n₁₂*N̄[j]*s₁*n₁
                k[9*I-4,3*J-2] += Δ*N[i]*n₁₂*N̄[j]*s₂*n₂
                k[9*I-3,3*J-2] += Δ*N[i]*n₁₂*N̄[j]*(s₁*n₂+s₂*n₁)
                k[9*I-2,3*J-2] += Δ*N[i]*n₁₃*N̄[j]*s₁*n₁
                k[9*I-1,3*J-2] += Δ*N[i]*n₁₃*N̄[j]*s₂*n₂
                k[9*I,3*J-2]   += Δ*N[i]*n₁₃*N̄[j]*(s₁*n₂+s₂*n₁)
                k[9*I-8,3*J-1] += Δ*N[i]*n₁₂*N̄[j]*s₁*n₁
                k[9*I-7,3*J-1] += Δ*N[i]*n₁₂*N̄[j]*s₂*n₂
                k[9*I-6,3*J-1] += Δ*N[i]*n₁₂*N̄[j]*(s₁*n₂+s₂*n₁)
                k[9*I-5,3*J-1] += Δ*N[i]*n₂₂*N̄[j]*s₁*n₁
                k[9*I-4,3*J-1] += Δ*N[i]*n₂₂*N̄[j]*s₂*n₂
                k[9*I-3,3*J-1] += Δ*N[i]*n₂₂*N̄[j]*(s₁*n₂+s₂*n₁)
                k[9*I-2,3*J-1] += Δ*N[i]*n₂₃*N̄[j]*s₁*n₁
                k[9*I-1,3*J-1] += Δ*N[i]*n₂₃*N̄[j]*s₂*n₂
                k[9*I,3*J-1]   += Δ*N[i]*n₂₃*N̄[j]*(s₁*n₂+s₂*n₁)
                k[9*I-8,3*J]   += Δ*N[i]*n₁₃*N̄[j]*s₁*n₁
                k[9*I-7,3*J]   += Δ*N[i]*n₁₃*N̄[j]*s₂*n₂
                k[9*I-6,3*J]   += Δ*N[i]*n₁₃*N̄[j]*(s₁*n₂+s₂*n₁)
                k[9*I-5,3*J]   += Δ*N[i]*n₂₃*N̄[j]*s₁*n₁
                k[9*I-4,3*J]   += Δ*N[i]*n₂₃*N̄[j]*s₂*n₂
                k[9*I-3,3*J]   += Δ*N[i]*n₂₃*N̄[j]*(s₁*n₂+s₂*n₁)
                k[9*I-2,3*J]   += Δ*N[i]*n₃₃*N̄[j]*s₁*n₁
                k[9*I-1,3*J]   += Δ*N[i]*n₃₃*N̄[j]*s₂*n₂
                k[9*I,3*J]     += Δ*N[i]*n₃₃*N̄[j]*(s₁*n₂+s₂*n₁)
            end
            f[9*I-8] += Δ*N[i]*(n₁₁*g₁+n₁₂*g₂+n₁₃*g₃)*s₁*n₁
            f[9*I-7] += Δ*N[i]*(n₁₁*g₁+n₁₂*g₂+n₁₃*g₃)*s₂*n₂
            f[9*I-6] += Δ*N[i]*(n₁₁*g₁+n₁₂*g₂+n₁₃*g₃)*(s₁*n₂+s₂*n₁)
            f[9*I-5] += Δ*N[i]*(n₁₂*g₁+n₂₂*g₂+n₂₃*g₃)*s₁*n₁
            f[9*I-4] += Δ*N[i]*(n₁₂*g₁+n₂₂*g₂+n₂₃*g₃)*s₂*n₂
            f[9*I-3] += Δ*N[i]*(n₁₂*g₁+n₂₂*g₂+n₂₃*g₃)*(s₁*n₂+s₂*n₁)
            f[9*I-2] += Δ*N[i]*(n₁₃*g₁+n₂₃*g₂+n₃₃*g₃)*s₁*n₁
            f[9*I-1] += Δ*N[i]*(n₁₃*g₁+n₂₃*g₂+n₃₃*g₃)*s₂*n₂
            f[9*I]   += Δ*N[i]*(n₁₃*g₁+n₂₃*g₂+n₃₃*g₃)*(s₁*n₂+s₂*n₁)
        end
    end
end

function (op::Operator{:∫∇𝑴∇𝒂₃𝒗dΩ})(a::T,b::S;k::AbstractMatrix{Float64}) where {T<:AbstractElement,S<:AbstractElement}
    𝓒ᵃ = a.𝓒;𝓖ᵃ = a.𝓖
    𝓒ᵇ = b.𝓒;𝓖ᵇ = b.𝓖
    for (ξᵃ,ξᵇ) in zip(𝓖ᵃ,𝓖ᵇ)
        𝑤 = ξᵃ.𝑤
        N = ξᵃ[:𝝭]
        B₁ = ξᵃ[:∂𝝭∂x]
        B₂ = ξᵃ[:∂𝝭∂y]
        B₁₁ = ξᵃ[:∂²𝝭∂x²]
        B₁₂ = ξᵃ[:∂²𝝭∂x∂y]
        B₂₂ = ξᵃ[:∂²𝝭∂y²]
        N̄ = ξᵇ[:𝝭]
        Γ¹₁₁ = ξᵃ.Γ¹₁₁
        Γ¹₁₂ = ξᵃ.Γ¹₁₂
        Γ¹₂₂ = ξᵃ.Γ¹₂₂
        Γ²₁₁ = ξᵃ.Γ²₁₁
        Γ²₁₂ = ξᵃ.Γ²₁₂
        Γ²₂₂ = ξᵃ.Γ²₂₂
        Γ¹₁₁₁ = ξᵃ.Γ¹₁₁₁
        Γ¹₁₁₂ = ξᵃ.Γ¹₁₁₂
        Γ¹₁₂₁ = ξᵃ.Γ¹₁₂₁
        Γ¹₁₂₂ = ξᵃ.Γ¹₁₂₂
        Γ¹₂₂₁ = ξᵃ.Γ¹₂₂₁
        Γ²₁₁₂ = ξᵃ.Γ²₁₁₂
        Γ²₁₂₂ = ξᵃ.Γ²₁₂₂
        Γ²₂₁₁ = ξᵃ.Γ²₂₁₁
        Γ²₂₁₂ = ξᵃ.Γ²₂₁₂
        Γ²₂₂₁ = ξᵃ.Γ²₂₂₁
        Γ²₂₂₂ = ξᵃ.Γ²₂₂₂

        Γᵞᵧ₁₁ = Γ¹₁₁₁+Γ²₂₁₁
        Γᵞᵧ₂₂ = Γ¹₁₂₂+Γ²₂₂₂
        Γᵞᵧ₁₂ = Γ¹₁₁₂+Γ²₂₁₂
        Γᵞᵧ₂₁ = Γ¹₁₂₁+Γ²₂₂₁
        Γᵞ₁₁ᵧ = Γ¹₁₁₁+Γ²₁₁₂
        Γᵞ₂₂ᵧ = Γ¹₂₂₁+Γ²₂₂₂
        Γᵞ₁₂ᵧ = Γ¹₁₂₁+Γ²₁₂₂

        Γᵞᵧ₁ = Γ¹₁₁+Γ²₁₂
        Γᵞᵧ₂ = Γ¹₁₂+Γ²₂₂
        Γᵞᵧ₁Γᵝᵦ₁ = Γᵞᵧ₁^2
        Γᵞᵧ₂Γᵝᵦ₂ = Γᵞᵧ₂^2
        Γᵞᵧ₁Γᵝᵦ₂ = Γᵞᵧ₁*Γᵞᵧ₂
        Γᵞᵧ₂Γᵝᵦ₁ = Γᵞᵧ₁*Γᵞᵧ₂
        ΓᵞᵧᵦΓᵝ₁₁ = Γᵞᵧ₁*Γ¹₁₁ + Γᵞᵧ₂*Γ²₁₁
        ΓᵞᵧᵦΓᵝ₂₂ = Γᵞᵧ₁*Γ¹₂₂ + Γᵞᵧ₂*Γ²₂₂
        ΓᵞᵧᵦΓᵝ₁₂ = Γᵞᵧ₁*Γ¹₁₂ + Γᵞᵧ₂*Γ²₁₂

        for (i,xᵢ) in enumerate(𝓒ᵃ)
            I = xᵢ.𝐼
            B̃₁₁ = B₁₁[i] + 2*Γᵞᵧ₁*B₁[i] + Γ¹₁₁*B₁[i] + Γ²₁₁*B₂[i] + (Γᵞᵧ₁₁+Γᵞ₁₁ᵧ+Γᵞᵧ₁Γᵝᵦ₁+ΓᵞᵧᵦΓᵝ₁₁)*N[i]
            B̃₂₂ = B₂₂[i] + 2*Γᵞᵧ₂*B₂[i] + Γ¹₂₂*B₁[i] + Γ²₂₂*B₂[i] + (Γᵞᵧ₂₂+Γᵞ₂₂ᵧ+Γᵞᵧ₂Γᵝᵦ₂+ΓᵞᵧᵦΓᵝ₂₂)*N[i]
            B̃₁₂ = 2*B₁₁[i] + 2*(Γᵞᵧ₁*B₂[i]+Γᵞᵧ₂*B₁[i]) + 2*(Γ¹₁₂*B₁[i] + Γ²₁₂*B₂[i]) + (Γᵞᵧ₁₂+Γᵞᵧ₂₁+2*Γᵞ₁₂ᵧ+Γᵞᵧ₁Γᵝᵦ₂+Γᵞᵧ₂Γᵝᵦ₁+2*ΓᵞᵧᵦΓᵝ₁₂)*N[i]
            for (j,xⱼ) in enumerate(𝓒ᵇ)
                J = xⱼ.𝐼
                k[9*I-8,3*J-2] += B̃₁₁*N̄[j]*𝑤
                k[9*I-7,3*J-2] += B̃₂₂*N̄[j]*𝑤
                k[9*I-6,3*J-2] += B̃₁₂*N̄[j]*𝑤
                k[9*I-5,3*J-1] += B̃₁₁*N̄[j]*𝑤
                k[9*I-4,3*J-1] += B̃₂₂*N̄[j]*𝑤
                k[9*I-3,3*J]   += B̃₁₂*N̄[j]*𝑤
                k[9*I-2,3*J]   += B̃₁₁*N̄[j]*𝑤
                k[9*I-1,3*J]   += B̃₂₂*N̄[j]*𝑤
                k[9*I,3*J]     += B̃₁₂*N̄[j]*𝑤
            end
        end
    end
end

function (op::Operator{:ScordelisLoRoof_𝐴})(ap::T) where T<:AbstractElement
    𝓒 = ap.𝓒
    ξ = ap.𝓖[1]
    w = 0.0
    N = ξ[:𝝭]
    for (i,xᵢ) in enumerate(𝓒)
        w += N[i]*xᵢ.d₃
    end
    return w
end
