function (op::Operator{:∫𝒂ᵢvᵢgᵢdΓ})(ap::T;k::AbstractMatrix{Float64},f::AbstractVector{Float64}) where T<:AbstractElement
    𝓒 = ap.𝓒; 𝓖 = ap.𝓖
    α₁ = op.α₁
    α₂ = op.α₂
    for ξ in 𝓖
        𝑤 = ξ.𝑤
        N = ξ[:𝝭]
        𝒂₁₍₁₎ = ξ.𝒂₁₍₁₎
        𝒂₁₍₃₎ = ξ.𝒂₁₍₃₎
        𝒂₂₍₁₎ = ξ.𝒂₂₍₁₎
        𝒂₂₍₃₎ = ξ.𝒂₂₍₃₎
        𝒂₃₍₁₎ = ξ.𝒂₃₍₁₎
        𝒂₃₍₃₎ = ξ.𝒂₃₍₃₎
        g₁ = ξ.g₁
        g₂ = ξ.g₂
        g₃ = ξ.g₃
        for (i,xᵢ) in enumerate(𝓒)
            I = xᵢ.𝐼
            for (j,xⱼ) in enumerate(𝓒)
                J = xⱼ.𝐼
                k[3*I-2,3*J-2] += N[i]*(α₁*𝒂₁₍₁₎^2+α₁*𝒂₂₍₁₎^2+α₂*𝒂₃₍₁₎^2)*N[j]*𝑤
                k[3*I-2,3*J-1] += 0
                k[3*I-2,3*J]   += N[i]*(α₁*𝒂₁₍₁₎*𝒂₁₍₃₎+α₁*𝒂₂₍₁₎*𝒂₂₍₃₎+α₂*𝒂₃₍₁₎*𝒂₃₍₃₎)*N[j]*𝑤
                k[3*I-1,3*J-2] += 0
                k[3*I-1,3*J-1] += 0
                k[3*I-1,3*J]   += 0
                k[3*I,3*J-2]   += N[i]*(α₁*𝒂₁₍₁₎*𝒂₁₍₃₎+α₁*𝒂₂₍₁₎*𝒂₂₍₃₎+α₂*𝒂₃₍₁₎*𝒂₃₍₃₎)*N[j]*𝑤
                k[3*I,3*J-1]   += 0
                k[3*I,3*J]     += N[i]*(α₁*𝒂₁₍₃₎^2+α₂*𝒂₃₍₃₎^2)*N[j]*𝑤
            end
            f[3*I-2] += N[i]*(α₁*𝒂₁₍₁₎*(𝒂₁₍₁₎*g₁+𝒂₁₍₃₎*g₃)+α₁*𝒂₂₍₁₎*(𝒂₂₍₁₎*g₁+𝒂₂₍₃₎*g₃)+α₂*𝒂₃₍₁₎*(𝒂₃₍₁₎*g₁+𝒂₃₍₃₎*g₃))*𝑤
            f[3*I-1] += 0
            f[3*I]   += N[i]*(α₁*𝒂₁₍₃₎*(𝒂₁₍₁₎*g₁+𝒂₁₍₃₎*g₃)+α₁*𝒂₂₍₃₎*(𝒂₂₍₁₎*g₁+𝒂₂₍₃₎*g₃)+α₂*𝒂₃₍₃₎*(𝒂₃₍₁₎*g₁+𝒂₃₍₃₎*g₃))*𝑤
        end
    end
end